node {
  name: "global_step/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "global_step"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global_step/Assign"
  op: "Assign"
  input: "global_step"
  input: "global_step/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global_step/read"
  op: "Identity"
  input: "global_step"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "IsVariableInitialized"
  op: "IsVariableInitialized"
  input: "global_step"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
}
node {
  name: "cond/Switch"
  op: "Switch"
  input: "IsVariableInitialized"
  input: "IsVariableInitialized"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "cond/switch_t"
  op: "Identity"
  input: "cond/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "cond/switch_f"
  op: "Identity"
  input: "cond/Switch"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "cond/pred_id"
  op: "Identity"
  input: "IsVariableInitialized"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "cond/read/Switch"
  op: "RefSwitch"
  input: "global_step"
  input: "cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "cond/read"
  op: "Identity"
  input: "cond/read/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "cond/Switch_1"
  op: "Switch"
  input: "global_step/Initializer/zeros"
  input: "cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "cond/Merge"
  op: "Merge"
  input: "cond/Switch_1"
  input: "cond/read"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "add/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "add"
  op: "Add"
  input: "cond/Merge"
  input: "add/y"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "Const"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 20000
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
            size: 20000
          }
        }
        string_val: "./above_data_train/American_Israeli_Cooperative_Enterprise_logo.png"
        string_val: "./above_data_train/SAIC_UK_logo.png"
        string_val: "./above_data_train/Yellowsign.png"
        string_val: "./above_data_train/Warlingham_School_Logo.jpg.png"
        string_val: "./above_data_train/Partido-Colorado.png"
        string_val: "./above_data_train/Walbottle_Campus_Technology_College_Logo.png"
        string_val: "./above_data_train/HopSkipDrive_logo.png"
        string_val: "./above_data_train/Logo_Qurtuba.png"
        string_val: "./above_data_train/Pirin_1922_logo.png"
        string_val: "./above_data_train/BIC-logo.png"
        string_val: "./above_data_train/Juneau,_AK_Police.png"
        string_val: "./above_data_train/Real_Kashmir_F.C._Logo.png"
        string_val: "./above_data_train/KVTT-AM_BizRadio_1110_logo.png"
        string_val: "./above_data_train/Mentholatum_Logo.png"
        string_val: "./above_data_train/Swinburne_University_of_Technology_(logo).png"
        string_val: "./above_data_train/KSWOLogo.png"
        string_val: "./above_data_train/TY_cap.PNG"
        string_val: "./above_data_train/Lisbon_2001_logo.png"
        string_val: "./above_data_train/Americana_Music_Association_logo.png"
        string_val: "./above_data_train/Foundation_for_People_with_Learning_Disabilities_Organisation_logo.png"
        string_val: "./above_data_train/APE_logo_green_thai_eng.png"
        string_val: "./above_data_train/KERX-FM_Max-FM_radio_logo.png"
        string_val: "./above_data_train/Hampden-Sydney_Seal.png"
        string_val: "./above_data_train/National_Institute_of_Advanced_Studies_logo.png"
        string_val: "./above_data_train/Logogcebargur.png"
        string_val: "./above_data_train/ActionBlueSkyLogo.png"
        string_val: "./above_data_train/Station_Park_Logo.svg.png"
        string_val: "./above_data_train/Stendhal_University_Logo.png"
        string_val: "./above_data_train/Boys_&_Girls_Aid_Logo.png"
        string_val: "./above_data_train/Billingham_Stars_Ice_Hockey_Team_Logo.png"
        string_val: "./above_data_train/Montana_State_Bobcats_logo.svg.png"
        string_val: "./above_data_train/Institute_for_Health_Metrics_and_Evaluation_logo_sm.png"
        string_val: "./above_data_train/Roanoke_Valley_Governor\'s_School_for_Science_and_Technology.png"
        string_val: "./above_data_train/Rozo_FC-logo.png"
        string_val: "./above_data_train/Westwood_Cross_Centre_Logo.png"
        string_val: "./above_data_train/UpFront_Logo.png"
        string_val: "./above_data_train/Tw_telecom_Logo_1.svg.png"
        string_val: "./above_data_train/Watanabe_entertainment.png"
        string_val: "./above_data_train/Romans_Seal.png"
        string_val: "./above_data_train/Natasha,_Pierre_and_The_Great_Comet_of_1812.png"
        string_val: "./above_data_train/Big_98-3_Indianapolis_2015.png"
        string_val: "./above_data_train/20080627_RSFlogo1.png"
        string_val: "./above_data_train/Systems_Technology_Institute.png"
        string_val: "./above_data_train/Eidsiva_logo.png"
        string_val: "./above_data_train/BSC_Logo.png"
        string_val: "./above_data_train/Aelk_sima_(2).png"
        string_val: "./above_data_train/Ark_Valley_High_Rollers_logo.png"
        string_val: "./above_data_train/Moscow_Kommunar_Machine-Building_Plant_logo.png"
        string_val: "./above_data_train/Cobalt_International_Energy_logo.png"
        string_val: "./above_data_train/North_hobart_fc_logo.png"
        string_val: "./above_data_train/Logo_for_Exar_Corporation.png"
        string_val: "./above_data_train/Flag_of_Langley,_British_Columbia.svg.png"
        string_val: "./above_data_train/MiamiSting.png"
        string_val: "./above_data_train/Illinois_State_Police.png"
        string_val: "./above_data_train/Wtap_dt3_old_mntv.png"
        string_val: "./above_data_train/Saudi_Arabiacr.png"
        string_val: "./above_data_train/Zimbabwe_Broadcasting_Corporation_(logo).png"
        string_val: "./above_data_train/Cbusrage2.PNG"
        string_val: "./above_data_train/Bridgwater_Town_FC_logo.png"
        string_val: "./above_data_train/EZPass_logo.svg.png"
        string_val: "./above_data_train/Victorian_Life_Sciences_Computation_Initiative_(logo).png"
        string_val: "./above_data_train/PDVAL_logo.png"
        string_val: "./above_data_train/Theater_Magdeburg_logo.png"
        string_val: "./above_data_train/Capitec_Bank_Logo.png"
        string_val: "./above_data_train/Nordic_Semiconductor_logo.png"
        string_val: "./above_data_train/HCMCWingsLogo.png"
        string_val: "./above_data_train/KSWA_station_logo.png"
        string_val: "./above_data_train/Moro_National_Liberation_Front_(emblem).png"
        string_val: "./above_data_train/Dobyns-Bennett_High_School_logo.png"
        string_val: "./above_data_train/Sega_Channel.svg.png"
        string_val: "./above_data_train/Soles_de_Mexicali_logo.png"
        string_val: "./above_data_train/Bhaktapur_Cancer_Hospital_logo.png"
        string_val: "./above_data_train/Creative_Mobile_Logo.png"
        string_val: "./above_data_train/Rivoli_United.png"
        string_val: "./above_data_train/Freebsd_logo.svg.png"
        string_val: "./above_data_train/Logo_of_the_eabh_(The_European_Association_for_Banking_and_Financial_History_e.V.).png"
        string_val: "./above_data_train/Perryhalllogo.png"
        string_val: "./above_data_train/Swedish_Social_Democratic_Party_Full_logo.png"
        string_val: "./above_data_train/Rowntrees-Fruit-Gums-Wrapper-Small.png"
        string_val: "./above_data_train/Tapura_Huiraatira_logo.png"
        string_val: "./above_data_train/Somali_FF_(logo).png"
        string_val: "./above_data_train/Ankeny-Comm.-Schools-Trademarked-Logo.png"
        string_val: "./above_data_train/Asociaci\303\263n_Iberoamericana_de_Atletismo_Logio.png"
        string_val: "./above_data_train/Tunisian_Railways_company_logo.png"
        string_val: "./above_data_train/Miramichi_Valley_High_School_logo.png"
        string_val: "./above_data_train/UE_L_Estartit_logo.png"
        string_val: "./above_data_train/WNNH991-082015.png"
        string_val: "./above_data_train/Ryukyusstingrays.png"
        string_val: "./above_data_train/Poetry_Out_Loud_Logo.png"
        string_val: "./above_data_train/Hurstpierpoint_college.png"
        string_val: "./above_data_train/South_University_of_Science_and_Technology_of_China_logo.png"
        string_val: "./above_data_train/SpVgg_Sulz.png"
        string_val: "./above_data_train/Lithuanian_University_of_Educational_Sciences_logo.png"
        string_val: "./above_data_train/New_Territories_East_Cluster_logo.svg.png"
        string_val: "./above_data_train/MMI_Holdings_Logo.png"
        string_val: "./above_data_train/StereoGraphics_Logo.png"
        string_val: "./above_data_train/WUMB919.png"
        string_val: "./above_data_train/Centre_d\303\251mocrate_humaniste_(logo).png"
        string_val: "./above_data_train/Airservices_Australia_logo.png"
        string_val: "./above_data_train/Inteliquent_Corporate_Logo.png"
        string_val: "./above_data_train/Tuskegee_University_seal.png"
        string_val: "./above_data_train/Triumph_logotype.png"
        string_val: "./above_data_train/Saputo_logo.svg.png"
        string_val: "./above_data_train/CLS_Music_logo.png"
        string_val: "./above_data_train/The_Jonathan_Ross_Show.png"
        string_val: "./above_data_train/PS_Uruguay_logo.png"
        string_val: "./above_data_train/TransformersG1Logo.png"
        string_val: "./above_data_train/Deportivo_Marte.png"
        string_val: "./above_data_train/Devonport_High_School_for_Girls_logo.png"
        string_val: "./above_data_train/Japan_Echo_Web_logo.png"
        string_val: "./above_data_train/Platipuslogo.png"
        string_val: "./above_data_train/Goodmorningloucester.png"
        string_val: "./above_data_train/K945.png"
        string_val: "./above_data_train/Taste_Real_Logo.png"
        string_val: "./above_data_train/Coleg_Llysfasi_logo.png"
        string_val: "./above_data_train/PBA_2014-15_logo.png"
        string_val: "./above_data_train/Pba2011_philcup.png"
        string_val: "./above_data_train/Hershey_Entertainment_and_Resorts_Company_logo.png"
        string_val: "./above_data_train/Youth_For_Understanding_(emblem).png"
        string_val: "./above_data_train/Northwestern_energy_logo.png"
        string_val: "./above_data_train/Harbin_Institute_of_Technology_(crest).png"
        string_val: "./above_data_train/Regal_recordings.png"
        string_val: "./above_data_train/NEXTV.png"
        string_val: "./above_data_train/\304\260dmanoca\304\237\304\261_logo.png"
        string_val: "./above_data_train/Growinguptitlescreen.png"
        string_val: "./above_data_train/DocNetwork_Logo.png"
        string_val: "./above_data_train/WXFX-FM_95-1_The_Fox_logo.png"
        string_val: "./above_data_train/Arena_Stage_logo.png"
        string_val: "./above_data_train/Innocent_Drinks.png"
        string_val: "./above_data_train/Murilla_Logo.png"
        string_val: "./above_data_train/VfL_Gummersbach_logo.png"
        string_val: "./above_data_train/Central_South_Univ_Motto_New.png"
        string_val: "./above_data_train/Chicago_Housing_Authority_(logo).png"
        string_val: "./above_data_train/KKBN_logo.png"
        string_val: "./above_data_train/Comsol_company_logo.png"
        string_val: "./above_data_train/OleMissRebels.png"
        string_val: "./above_data_train/CNBC_Europe_-_European_Market_Watch_logo_2001.png"
        string_val: "./above_data_train/Corner_Shot_Holdings_logo.png"
        string_val: "./above_data_train/KTFY_logo.png"
        string_val: "./above_data_train/InsWeb_Logo.png"
        string_val: "./above_data_train/Tennessee_Valley_Authority_PD.png"
        string_val: "./above_data_train/Girl_Scouts_of_the_Philippines_2010.png"
        string_val: "./above_data_train/Science_Olympiad_Logo.svg.png"
        string_val: "./above_data_train/Palestinian_Airlines.PNG"
        string_val: "./above_data_train/EngineeringUK_primary_logo.png"
        string_val: "./above_data_train/CCWHA_logo.png"
        string_val: "./above_data_train/Logo_Fritz_Hansen.png"
        string_val: "./above_data_train/Muir_of_Ord_Rovers_badge.png"
        string_val: "./above_data_train/MANIT.Bhopal.png"
        string_val: "./above_data_train/2015_VTV_Cup_Logo.png"
        string_val: "./above_data_train/Cloudian_logo.png"
        string_val: "./above_data_train/St.George\'s2016logo.png"
        string_val: "./above_data_train/Tspcb_logo.png"
        string_val: "./above_data_train/WWAV_logo.png"
        string_val: "./above_data_train/PHRPMCH.png"
        string_val: "./above_data_train/Intesa_Veneta.png"
        string_val: "./above_data_train/Lee_Woo_Sing_College_Emblem.png"
        string_val: "./above_data_train/Redbrick_Newspaper_Logo.png"
        string_val: "./above_data_train/1997_WNBA_Finals_logo.png"
        string_val: "./above_data_train/Lebanesearmyofficialflag.png"
        string_val: "./above_data_train/American-Comics-Group-ACG-logo-sub.png"
        string_val: "./above_data_train/Mixpanel_logo.png"
        string_val: "./above_data_train/WWOW_Logo.png"
        string_val: "./above_data_train/International_Day_Against_Homophobia,_Transphobia_and_Biphobia_Logo.png"
        string_val: "./above_data_train/African_Union_flag.svg.png"
        string_val: "./above_data_train/StLukesTokyo.png"
        string_val: "./above_data_train/Universit\303\251_Des_Montagnes_Logo.png"
        string_val: "./above_data_train/Mc-Gann-Mercy_logo.png"
        string_val: "./above_data_train/Platform2_logo.png"
        string_val: "./above_data_train/Zope_foundation_grok_logo.png"
        string_val: "./above_data_train/HarmonyGoldLogo.png"
        string_val: "./above_data_train/Gosensportslogo.png"
        string_val: "./above_data_train/Freepeopletype.png"
        string_val: "./above_data_train/WayneCollegeLogo.png"
        string_val: "./above_data_train/Superchannel-paytv.png"
        string_val: "./above_data_train/NickatNite10th_1.png"
        string_val: "./above_data_train/TripAdvisor_logo.svg.png"
        string_val: "./above_data_train/Toontown-Logo.svg.png"
        string_val: "./above_data_train/Ckuk-logo.png"
        string_val: "./above_data_train/Islamic_International_Arab_Bank.PNG"
        string_val: "./above_data_train/Big_Brother_eye_logo_for_the_2016_civilian_series.png"
        string_val: "./above_data_train/Logo_Opus_X.png"
        string_val: "./above_data_train/Streetcar_Logo.png"
        string_val: "./above_data_train/Pyeonghwa_Motors.png"
        string_val: "./above_data_train/The_Banyan_(NGO)_Logo.png"
        string_val: "./above_data_train/SV_Motor_Altenburg.png"
        string_val: "./above_data_train/Quake_logo.png"
        string_val: "./above_data_train/Nustbadge.png"
        string_val: "./above_data_train/Adeline_records.png"
        string_val: "./above_data_train/Delphi_logo_1997.png"
        string_val: "./above_data_train/Pantagraph.png"
        string_val: "./above_data_train/British_Basketball_logo.png"
        string_val: "./above_data_train/Barcelona_Dragons_Logo.svg.png"
        string_val: "./above_data_train/Intel_Pentium_III_Processor_Logo.svg.png"
        string_val: "./above_data_train/KXMNMeTV.png"
        string_val: "./above_data_train/Ieamericaold.png"
        string_val: "./above_data_train/Iranian_Space_Research_Center_Logo.png"
        string_val: "./above_data_train/Western_Playland_Logo.png"
        string_val: "./above_data_train/IXIT_Corporation_logo.png"
        string_val: "./above_data_train/MUSC_logo.png"
        string_val: "./above_data_train/Spring_Airlines_Japan_logo.png"
        string_val: "./above_data_train/Whammy!_The_All-New_Press_Your_Luck.png"
        string_val: "./above_data_train/Cleveland_Indians_cap_logo.svg.png"
        string_val: "./above_data_train/EHOME_logo.png"
        string_val: "./above_data_train/Federated_Ironworkers\'_Association_logo.png"
        string_val: "./above_data_train/Million_pound_game.png"
        string_val: "./above_data_train/Baker\'s_Supermarkets.png"
        string_val: "./above_data_train/Logo_of_International_Ecological_Safety_Collaborative_Organization.png"
        string_val: "./above_data_train/VFC_Plauen.png"
        string_val: "./above_data_train/Raqqa_Hawks_Brigade_logo.png"
        string_val: "./above_data_train/GPCAHPC.png"
        string_val: "./above_data_train/Junior_Eurovision_Song_Contest_2015_logo.png"
        string_val: "./above_data_train/MCS_Logo_wiki.png"
        string_val: "./above_data_train/International_Film_Festival_of_India_Official_Logo.png"
        string_val: "./above_data_train/Freeplay_Energy_Logo.png"
        string_val: "./above_data_train/ICQ.svg.png"
        string_val: "./above_data_train/SOTALOGO.png"
        string_val: "./above_data_train/DDees4.png"
        string_val: "./above_data_train/KCHI-FM_logo.png"
        string_val: "./above_data_train/IRI_Achievement_Award.png"
        string_val: "./above_data_train/MultiService_Forum_logo.png"
        string_val: "./above_data_train/8th_Empire_Awards_logo.png"
        string_val: "./above_data_train/Fox_Sports_Networks_logo.png"
        string_val: "./above_data_train/Seal_of_South_Jeolla.svg.png"
        string_val: "./above_data_train/St_John\'s_Prep_Emblem.png"
        string_val: "./above_data_train/Katunga_proper_joursey.png"
        string_val: "./above_data_train/Knights09sm2.png"
        string_val: "./above_data_train/Chaospromo.png"
        string_val: "./above_data_train/Xtown_shootout2008.png"
        string_val: "./above_data_train/Dbti_logo_1.png"
        string_val: "./above_data_train/Original_West_Towne_Mall_logo.png"
        string_val: "./above_data_train/Tonyawardslogo.png"
        string_val: "./above_data_train/Camogie_Association_logo.png"
        string_val: "./above_data_train/WKSR-FM_logo.png"
        string_val: "./above_data_train/International_Education_College_logo.png"
        string_val: "./above_data_train/NewsTalk650CKOM.png"
        string_val: "./above_data_train/Companion_tools_logo.png"
        string_val: "./above_data_train/Logo_builders_square.png"
        string_val: "./above_data_train/WCFX-FM.png"
        string_val: "./above_data_train/Ndeb.ca.png"
        string_val: "./above_data_train/CarbonMotorsCorporationLogo.png"
        string_val: "./above_data_train/University_of_Juba.png"
        string_val: "./above_data_train/MonacoCoachLogo.png"
        string_val: "./above_data_train/Belleayrelogo.png"
        string_val: "./above_data_train/Durhamconstabulary.png"
        string_val: "./above_data_train/AMD_Athlon64_Mobile.png"
        string_val: "./above_data_train/Flylab_Logo_2012.png"
        string_val: "./above_data_train/Myrtle_Beach_Mutiny_logo.png"
        string_val: "./above_data_train/2CycleTrailBW.png"
        string_val: "./above_data_train/WCAT1390logo.png"
        string_val: "./above_data_train/CNBC_U.S._-_Wake_Up_Call_logo_2003.png"
        string_val: "./above_data_train/1077_KRXO_Classic_Rock.png"
        string_val: "./above_data_train/BellGlobemedia.png"
        string_val: "./above_data_train/Office_of_the_Leader_of_the_House_of_Lords.png"
        string_val: "./above_data_train/Thealegreen.png"
        string_val: "./above_data_train/Yorkshire_Building_Society.svg.png"
        string_val: "./above_data_train/Antasports.png"
        string_val: "./above_data_train/Saralee-logo.png"
        string_val: "./above_data_train/RIOC_logo.svg.png"
        string_val: "./above_data_train/Thomasville_City_Seal.png"
        string_val: "./above_data_train/GraphvizLogo.png"
        string_val: "./above_data_train/Mafia-k1-fry-logo.png"
        string_val: "./above_data_train/Asuna_logo.png"
        string_val: "./above_data_train/KEUV31.png"
        string_val: "./above_data_train/Sydney_College_of_the_Arts_(logo).png"
        string_val: "./above_data_train/VoorheesHighSchoolLogo.png"
        string_val: "./above_data_train/Crest_orig.png"
        string_val: "./above_data_train/Ver.di_logo.png"
        string_val: "./above_data_train/FX_UK_logo_2009.png"
        string_val: "./above_data_train/UCL_old_logo.png"
        string_val: "./above_data_train/People\'s_Democratic_Party.png"
        string_val: "./above_data_train/Pinoy_Explorer_logo.png"
        string_val: "./above_data_train/Foyle\'s_War_title_card.png"
        string_val: "./above_data_train/Midlands_State_University_(shield).png"
        string_val: "./above_data_train/Suffolk_University_Logo_.png"
        string_val: "./above_data_train/Florida_Gulf_Coast_University_seal.svg.png"
        string_val: "./above_data_train/Las_Vegas_Fabulous_Sin_City_Rollergirls.png"
        string_val: "./above_data_train/GAY.tv.PNG"
        string_val: "./above_data_train/A.O._Amyntas_Dafnis_B.C._Logo.png"
        string_val: "./above_data_train/Scott_Christian_University_logo.png"
        string_val: "./above_data_train/Stadium_Jakarta_Basketball.png"
        string_val: "./above_data_train/Logo_for_Quench_USA_Inc.png"
        string_val: "./above_data_train/Dreyfuscorp.png"
        string_val: "./above_data_train/JebheMottahed90.png"
        string_val: "./above_data_train/Bassalegschool.png"
        string_val: "./above_data_train/Aljazeera.svg.png"
        string_val: "./above_data_train/Williams_Fresh_Cafe_Logo.png"
        string_val: "./above_data_train/Blue_Demons.png"
        string_val: "./above_data_train/Rugby_Australia.svg.png"
        string_val: "./above_data_train/IIFJ-logo-sabz.png"
        string_val: "./above_data_train/VS_logo2.png"
        string_val: "./above_data_train/WHWT-FM_logo_new.png"
        string_val: "./above_data_train/Payonline.ru.png"
        string_val: "./above_data_train/Copleyhead.png"
        string_val: "./above_data_train/Stornoway_Communications.PNG"
        string_val: "./above_data_train/Timbro.svg.png"
        string_val: "./above_data_train/LRT_radijas.png"
        string_val: "./above_data_train/IowaPublicTelevision.png"
        string_val: "./above_data_train/Connaughtlogo.PNG"
        string_val: "./above_data_train/Seacom_skills_university_logo.PNG"
        string_val: "./above_data_train/Logo-RCP_Design_Global_agency.png"
        string_val: "./above_data_train/Open_House_Party_Original_Logo_1987.png"
        string_val: "./above_data_train/Cerberus64.png"
        string_val: "./above_data_train/Bozeman_Yellowstone_International_Airport_logo.png"
        string_val: "./above_data_train/UPR_at_Arecibo_Seal.svg.png"
        string_val: "./above_data_train/OllertonTownFC.png"
        string_val: "./above_data_train/OMG!_Radio_97.7.png"
        string_val: "./above_data_train/City_of_South_Melbourne_Logo.png"
        string_val: "./above_data_train/Program_b.png"
        string_val: "./above_data_train/Logo_of_National_Rainbow_Coalition_NARC.png"
        string_val: "./above_data_train/World\'s_Most_Amazing_Videos_Logo.png"
        string_val: "./above_data_train/Timpviewlogo.png"
        string_val: "./above_data_train/UMES_seal.png"
        string_val: "./above_data_train/Anglesey_arms.png"
        string_val: "./above_data_train/Quetta_Gladiators.png"
        string_val: "./above_data_train/KXYL_station_logo.png"
        string_val: "./above_data_train/IRely_LLC_Logo_low_res.png"
        string_val: "./above_data_train/Mukfellas.png"
        string_val: "./above_data_train/Seiko_Companies_Logos.png"
        string_val: "./above_data_train/Oldoriginalbookbinders.png"
        string_val: "./above_data_train/10-5a_logo.png"
        string_val: "./above_data_train/Rosalkaposter.png"
        string_val: "./above_data_train/HDVMDlogo.png"
        string_val: "./above_data_train/Australian_Rock_Database_(logo).png"
        string_val: "./above_data_train/WPRUABC.png"
        string_val: "./above_data_train/Northern_Alberta_Railways_logo.png"
        string_val: "./above_data_train/Westmoreland_Seal.png"
        string_val: "./above_data_train/SunTVNews.png"
        string_val: "./above_data_train/My_Friend_Rabbit_title_card.png"
        string_val: "./above_data_train/Pima_County,_Arizona_seal.png"
        string_val: "./above_data_train/Eurosport_2_xtra_logo.png"
        string_val: "./above_data_train/Dominionlogo.png"
        string_val: "./above_data_train/ClearFoundation_logo_green_2016.png"
        string_val: "./above_data_train/POSTECH_logo.svg.png"
        string_val: "./above_data_train/Green_Party_of_Aotearoa_New_Zealand_logo.svg.png"
        string_val: "./above_data_train/Hannity_Logo.png"
        string_val: "./above_data_train/Elysian_brewing_company_logo.png"
        string_val: "./above_data_train/Biopython_logo.png"
        string_val: "./above_data_train/Labour_Party_Ireland_logo_2017.svg.png"
        string_val: "./above_data_train/French_Blue_logo.png"
        string_val: "./above_data_train/E-Cell_IIT_Bombay_logo.png"
        string_val: "./above_data_train/Richmondshire_arms.png"
        string_val: "./above_data_train/Protecode-logo.PNG"
        string_val: "./above_data_train/WJMR-FM_(logo).png"
        string_val: "./above_data_train/Atmospherevfxlogo.png"
        string_val: "./above_data_train/Unforgettable_promo_logo.png"
        string_val: "./above_data_train/2009IPC_Swimming_Reykjavik_logo.png"
        string_val: "./above_data_train/EKB-Egyptian-Knowledge-Bank.png"
        string_val: "./above_data_train/KZPR-FM.png"
        string_val: "./above_data_train/QI_News.png"
        string_val: "./above_data_train/Mshslogo.png"
        string_val: "./above_data_train/Isle_of_Mancr.png"
        string_val: "./above_data_train/Ch_hits_mix_xm_lg.png"
        string_val: "./above_data_train/Royal_Society_for_the_Protection_of_Birds_logo.svg.png"
        string_val: "./above_data_train/The_Civilian_logo.png"
        string_val: "./above_data_train/Walkerswelcome.png"
        string_val: "./above_data_train/Trondhjemsturnforening.png"
        string_val: "./above_data_train/Lewica_i_Demokraci.png"
        string_val: "./above_data_train/Worland.png"
        string_val: "./above_data_train/Feslogo.png"
        string_val: "./above_data_train/UNAF_Club_Cup_(logo).png"
        string_val: "./above_data_train/OnDeckCircleLogo.png"
        string_val: "./above_data_train/CIMC-TV.png"
        string_val: "./above_data_train/Costa_Cruises_Logo.png"
        string_val: "./above_data_train/Lincoln_HS_Patriots.png"
        string_val: "./above_data_train/WHHM-FM_logo.png"
        string_val: "./above_data_train/Abdelmalek_Essaadi_University.png"
        string_val: "./above_data_train/SJC_Crest.png"
        string_val: "./above_data_train/Saskbladesold.png"
        string_val: "./above_data_train/World_Currency_Unit_(symbol).png"
        string_val: "./above_data_train/Sirius_XM_prime_country_logo.png"
        string_val: "./above_data_train/City_Creek_logo.svg.png"
        string_val: "./above_data_train/KZIO-FM_94X_radio_logo.png"
        string_val: "./above_data_train/Mike_and_the_Mad_Dog.png"
        string_val: "./above_data_train/Dr._Oetker_Logo.png"
        string_val: "./above_data_train/M_fctokyo.png"
        string_val: "./above_data_train/Viasat_Sport_Baltic_logo.png"
        string_val: "./above_data_train/In_Your_Pocket_Logo.PNG"
        string_val: "./above_data_train/Janesville_Transit_System_logo.png"
        string_val: "./above_data_train/EustonManifesto.png"
        string_val: "./above_data_train/Zee_Bollynova.png"
        string_val: "./above_data_train/Rainstor_logo.png"
        string_val: "./above_data_train/Mybariatric300logo.png"
        string_val: "./above_data_train/DhiTVlogo.png"
        string_val: "./above_data_train/TorontoMapleLeafs_logo.svg.png"
        string_val: "./above_data_train/Chee.Toz_logo.png"
        string_val: "./above_data_train/Freederm-logo.png"
        string_val: "./above_data_train/Red_Rock_Logo.png"
        string_val: "./above_data_train/International_Traditional_Karate_Federation_Logo.png"
        string_val: "./above_data_train/Octopus_Logo_(2017).png"
        string_val: "./above_data_train/SAS_Macogep_jersey.png"
        string_val: "./above_data_train/Spooks_code_9_482x62.png"
        string_val: "./above_data_train/Constellation_Energy.png"
        string_val: "./above_data_train/Palm_Islands_nature_reserve_logo_.png"
        string_val: "./above_data_train/St-hildas-college-crest.png"
        string_val: "./above_data_train/ChannelFlip_Logo.png"
        string_val: "./above_data_train/Palit_logo.png"
        string_val: "./above_data_train/Shub_new.png"
        string_val: "./above_data_train/Live_Well_Network_(logo).png"
        string_val: "./above_data_train/KRUZ_106.7.png"
        string_val: "./above_data_train/PWA_NFO.png"
        string_val: "./above_data_train/Rubene_logo.png"
        string_val: "./above_data_train/AC_Bellaria_Igea_Marina_logo.png"
        string_val: "./above_data_train/Academy_SC.png"
        string_val: "./above_data_train/Caribbeanuniversitylogo.png"
        string_val: "./above_data_train/Bestival_Logo.png"
        string_val: "./above_data_train/MaccabiSha\'arayim.png"
        string_val: "./above_data_train/PhillyCarShare_logo.png"
        string_val: "./above_data_train/Indianapolis_Metropolitan_Police_Department_(logo).png"
        string_val: "./above_data_train/Wdbj-7_too.png"
        string_val: "./above_data_train/UDA_logo.png"
        string_val: "./above_data_train/American_College_of_Healthcare_Sciences_(logo).png"
        string_val: "./above_data_train/ACTC_logo.png"
        string_val: "./above_data_train/LogoTapuz.png"
        string_val: "./above_data_train/Hongseong_logo.png"
        string_val: "./above_data_train/2016_Christmas_Handball_Tournament_of_Four_logo.png"
        string_val: "./above_data_train/IEEE_1355_logo.png"
        string_val: "./above_data_train/Logo-hcmut.svg.png"
        string_val: "./above_data_train/Fleetwood_park_Logo.png"
        string_val: "./above_data_train/2015_Asian_Judo_Championships_logo.png"
        string_val: "./above_data_train/KY_-_DFWR_Badge.png"
        string_val: "./above_data_train/MyPhone_pinoy_phone_Logo.png"
        string_val: "./above_data_train/Interlachen_HS_Logo.png"
        string_val: "./above_data_train/Winning_Putt_Logo_Transparent.png"
        string_val: "./above_data_train/TIHR_Logo.png"
        string_val: "./above_data_train/Sbvflag.png"
        string_val: "./above_data_train/Green_Light_Trust_Logo.png"
        string_val: "./above_data_train/VernonHillsILlogo.png"
        string_val: "./above_data_train/Hustseals.png"
        string_val: "./above_data_train/KRSC_Logo_2015.png"
        string_val: "./above_data_train/Foreign_Trade_University_logo.png"
        string_val: "./above_data_train/TCKIMAGE.png"
        string_val: "./above_data_train/RSGCrest.png"
        string_val: "./above_data_train/KHKY-FM_2015.PNG"
        string_val: "./above_data_train/2009_World_Series.svg.png"
        string_val: "./above_data_train/Orange_County,_Virginia_seal.png"
        string_val: "./above_data_train/Snap-on_logo.svg.png"
        string_val: "./above_data_train/CalRipkenRealBaseBall_logo.png"
        string_val: "./above_data_train/Symmaxia_Politon_logo.png"
        string_val: "./above_data_train/Chemical_Industries_Association_logo.png"
        string_val: "./above_data_train/Destiny_USA_logo.png"
        string_val: "./above_data_train/Vanwall_logo.png"
        string_val: "./above_data_train/Semel_Monosson-S.png"
        string_val: "./above_data_train/Desmoinesmenaceold.png"
        string_val: "./above_data_train/Unirea_Tarlungeni_logo.png"
        string_val: "./above_data_train/Magic_radio.png"
        string_val: "./above_data_train/IrishFencingFederation.PNG"
        string_val: "./above_data_train/Collier_bw_logo.png"
        string_val: "./above_data_train/2016_MLS_SuperDraft_logo.png"
        string_val: "./above_data_train/Nwmobile.png"
        string_val: "./above_data_train/Wuhan_University_Logo.png"
        string_val: "./above_data_train/NYCGHA_crest.png"
        string_val: "./above_data_train/VoteYes2Nice.png"
        string_val: "./above_data_train/WPX_Energy_Logo_2015.svg.png"
        string_val: "./above_data_train/Southwood_logo.png"
        string_val: "./above_data_train/Journal_Media_Group_logo.png"
        string_val: "./above_data_train/Shaare_zedek_logo.png"
        string_val: "./above_data_train/Video_Game_Orchestra-logo.png"
        string_val: "./above_data_train/Swastik_Pictures.png"
        string_val: "./above_data_train/Aztecaproductions_logo.png"
        string_val: "./above_data_train/UT_-_Weber_County_Sheriff.png"
        string_val: "./above_data_train/Jims_Logo.png"
        string_val: "./above_data_train/Larson_O\'Brien_logo.png"
        string_val: "./above_data_train/SealofPLU.png"
        string_val: "./above_data_train/Nevsun_logo.png"
        string_val: "./above_data_train/Geenstijl-logo.png"
        string_val: "./above_data_train/EuropeStreet.png"
        string_val: "./above_data_train/International_Whiskey_Competition_article.png"
        string_val: "./above_data_train/AKUT_Search_and_Rescue_Association_logo.png"
        string_val: "./above_data_train/NewZescoUtdFClogo.png"
        string_val: "./above_data_train/CLOSERS_LOGO.png"
        string_val: "./above_data_train/Tenix_logo.PNG"
        string_val: "./above_data_train/Seahorse_rou_japan_deaf.png"
        string_val: "./above_data_train/CB_Approximated_Logo.svg.png"
        string_val: "./above_data_train/WolfBlock.png"
        string_val: "./above_data_train/World_Food_Championships_logo.png"
        string_val: "./above_data_train/Children_of_the_Nations_logo.png"
        string_val: "./above_data_train/PanjivaLogo.png"
        string_val: "./above_data_train/AFC_U-19_Championship.png"
        string_val: "./above_data_train/Alberta_Golden_Bears_Logo.svg.png"
        string_val: "./above_data_train/Kimfly_logo.png"
        string_val: "./above_data_train/ChorLeoni-300dpi.png"
        string_val: "./above_data_train/BollesSchoolLogo.PNG"
        string_val: "./above_data_train/WGOC.png"
        string_val: "./above_data_train/Mount_Morgan_Logo.png"
        string_val: "./above_data_train/Kingsmead_School_Crest.svg.png"
        string_val: "./above_data_train/Minifigures_Logo.png"
        string_val: "./above_data_train/Government_Medical_College_and_Hospital,_Chandigarh_logo.png"
        string_val: "./above_data_train/Bristol_Siddeley_logo.png"
        string_val: "./above_data_train/2017_FIBA_Asia_Women\'s_Cup.png"
        string_val: "./above_data_train/Prince_George\'s_County_Public_Schools_Logo.svg.png"
        string_val: "./above_data_train/ZackQuackLogoTrans.png"
        string_val: "./above_data_train/WSBT-DT2_Logo.png"
        string_val: "./above_data_train/SPBW_shield.png"
        string_val: "./above_data_train/StocktonPorts.png"
        string_val: "./above_data_train/Guidance_logo_98-99.png"
        string_val: "./above_data_train/Westfield_Academy,_Yeovil,_logo_(2012).png"
        string_val: "./above_data_train/Soncino_Press_Logo.png"
        string_val: "./above_data_train/Slamtvlogo.png"
        string_val: "./above_data_train/Biosislogo.png"
        string_val: "./above_data_train/Planmed_logo.svg.png"
        string_val: "./above_data_train/WBOQ_logo.png"
        string_val: "./above_data_train/Shorelandlogo.png"
        string_val: "./above_data_train/Wollongong_Wolves.png"
        string_val: "./above_data_train/Colorado_State_Fair_Logo.png"
        string_val: "./above_data_train/Teslagrad-Logo-550x82.png"
        string_val: "./above_data_train/Fuerza_Regia_2015_Logo.png"
        string_val: "./above_data_train/NEUST.png"
        string_val: "./above_data_train/CKMF-FM.png"
        string_val: "./above_data_train/Escom.png"
        string_val: "./above_data_train/Wget.png"
        string_val: "./above_data_train/Kordia.png"
        string_val: "./above_data_train/Wnuv_1995.png"
        string_val: "./above_data_train/FC_Tampa_Bay.png"
        string_val: "./above_data_train/Apple-Jacks-Box-Small.png"
        string_val: "./above_data_train/NJPW_Destruction.png"
        string_val: "./above_data_train/World_Taekwondo_2017.png"
        string_val: "./above_data_train/Lotterywest_logo.png"
        string_val: "./above_data_train/Fudan_University.png"
        string_val: "./above_data_train/Speedway_LLC_Logo.png"
        string_val: "./above_data_train/Odyssey_Logo.png"
        string_val: "./above_data_train/KDLT_Logo.png"
        string_val: "./above_data_train/Knightsofpythias.png"
        string_val: "./above_data_train/Global_Supply_Systems_Logo.png"
        string_val: "./above_data_train/Dwclaoaglogo.png"
        string_val: "./above_data_train/Club_Penguin_Island_Logo.png"
        string_val: "./above_data_train/Sfi_logo-200px.png"
        string_val: "./above_data_train/Institute_and_Faculty_of_Actuaries_-_Logo.png"
        string_val: "./above_data_train/Midland_RockHounds_logo.png"
        string_val: "./above_data_train/Fire_and_Emergency_New_Zealand_logo.png"
        string_val: "./above_data_train/Senomyx_logo.PNG"
        string_val: "./above_data_train/Perth_Sharks_Logo.png"
        string_val: "./above_data_train/SBTN_TV.png"
        string_val: "./above_data_train/Ian_Fleming_International_Airport_Logo.png"
        string_val: "./above_data_train/The_current_logo_of_70s_on_7.png"
        string_val: "./above_data_train/Button_csl_Rollover.png"
        string_val: "./above_data_train/SimmsFishingProductsLogo.png"
        string_val: "./above_data_train/Landbouwkrediet-Euphony_logo.png"
        string_val: "./above_data_train/Bugdom_2_logo.png"
        string_val: "./above_data_train/Eng_linja.png"
        string_val: "./above_data_train/BookRags_logo.png"
        string_val: "./above_data_train/WTVH5.png"
        string_val: "./above_data_train/Maddux-air.png"
        string_val: "./above_data_train/KADDBlogo.png"
        string_val: "./above_data_train/SomaLogic_logo.png"
        string_val: "./above_data_train/Canarian_Parliament_logo.png"
        string_val: "./above_data_train/Australian_Recording_Industry_Association_Logo.png"
        string_val: "./above_data_train/Eccleshall_FC_logo.png"
        string_val: "./above_data_train/Sporttv1998.png"
        string_val: "./above_data_train/RegentAirwaysLogo.png"
        string_val: "./above_data_train/SC_Kobrin_Logo.png"
        string_val: "./above_data_train/Central_Oregon_and_Pacific_Railroad.png"
        string_val: "./above_data_train/Simerini_logo.png"
        string_val: "./above_data_train/Swmhslogo1.png"
        string_val: "./above_data_train/Latvijas_Banka_logo.svg.png"
        string_val: "./above_data_train/NYSIA.png"
        string_val: "./above_data_train/Poblogo2.png"
        string_val: "./above_data_train/Parti_Keadilan_Masyarakat_Malaysia.png"
        string_val: "./above_data_train/Seal_of_Indian_Beach,_North_Carolina.png"
        string_val: "./above_data_train/WPMI_NBC_15.png"
        string_val: "./above_data_train/Company_logo_for_Indix.png"
        string_val: "./above_data_train/Neela_Tele_Films_Private_Limited.png"
        string_val: "./above_data_train/Brookfield_High_School_(Connecticut)_Logo.png"
        string_val: "./above_data_train/Bullying_UK_logo.png"
        string_val: "./above_data_train/ConservLogoCol-web.png"
        string_val: "./above_data_train/WWFX_logo.png"
        string_val: "./above_data_train/E748a_jun27_vienna.png"
        string_val: "./above_data_train/KNDD_Black_Logo.png"
        string_val: "./above_data_train/Holland_Jachtbouw_logo.jpg.png"
        string_val: "./above_data_train/UltramanGeedTitle.png"
        string_val: "./above_data_train/Optinmonster_logo.png"
        string_val: "./above_data_train/S\303\266dra_logo.svg.png"
        string_val: "./above_data_train/Goozex_Logo240.png"
        string_val: "./above_data_train/Renorenegades.PNG"
        string_val: "./above_data_train/TSV_Landesberg.png"
        string_val: "./above_data_train/Planet_Rugby_logo.png"
        string_val: "./above_data_train/Antiques_Roadshow_(title_card).png"
        string_val: "./above_data_train/St._andrew\'s.png"
        string_val: "./above_data_train/Jazz_FM_logo.png"
        string_val: "./above_data_train/Lutheran_church_canada_logo.png"
        string_val: "./above_data_train/UNIT_wing.png"
        string_val: "./above_data_train/Bournemouth_Water_logo.png"
        string_val: "./above_data_train/HEBA_Logo2.png"
        string_val: "./above_data_train/Skyleader_a.s._Logo_2015.png"
        string_val: "./above_data_train/Chemung_County,_NY_Office_of_Sheriff.png"
        string_val: "./above_data_train/Erbert_and_Gerberts_Logo.png"
        string_val: "./above_data_train/Thepredatorep.png"
        string_val: "./above_data_train/IIM_Bangalore_Logo.svg.png"
        string_val: "./above_data_train/Sweetbay_Supermarkets_Logo.svg.png"
        string_val: "./above_data_train/Polytechnic_University_of_the_Philippines_Calauan_Logo.svg.png"
        string_val: "./above_data_train/Amphi_logo.png"
        string_val: "./above_data_train/BishLogo2012.png"
        string_val: "./above_data_train/Sex_Love_&_Secrets.png"
        string_val: "./above_data_train/Gcsulogo.png"
        string_val: "./above_data_train/Rocks_TV_2010_logojpg.png"
        string_val: "./above_data_train/Camden_Asset_Recovery_Interagency_Network_logo.svg.png"
        string_val: "./above_data_train/SignatureTheatreArlington_logo.png"
        string_val: "./above_data_train/Harlem-childrens-zone.png"
        string_val: "./above_data_train/Hueneme_Beach_Festival_(emblem).png"
        string_val: "./above_data_train/DGF_Flensborg.png"
        string_val: "./above_data_train/Kraft_Cheese_Nips.png"
        string_val: "./above_data_train/KZPS-FM.png"
        string_val: "./above_data_train/Logo_medicina.png"
        string_val: "./above_data_train/Seagle_Air_logo.png"
        string_val: "./above_data_train/2009wwhcc.png"
        string_val: "./above_data_train/Thomas_Nelson_CC_logo.svg.png"
        string_val: "./above_data_train/Lavalla075.png"
        string_val: "./above_data_train/Legacy_Button_Final.png"
        string_val: "./above_data_train/BICC_College_Logo.png"
        string_val: "./above_data_train/NipperIconAug2007.png"
        string_val: "./above_data_train/Ski_Snow_Valley_Logo_2017.png"
        string_val: "./above_data_train/Donor_Sibling_Registry_Logo_180_pix.png"
        string_val: "./above_data_train/2009_World_Wushu_Championships_logo.png"
        string_val: "./above_data_train/SWATCH_FIVB_World_Tour_2004_Logo.png"
        string_val: "./above_data_train/Savethelemur.png"
        string_val: "./above_data_train/WJTO730.png"
        string_val: "./above_data_train/Euroclear_logo.png"
        string_val: "./above_data_train/Zain_logo.png"
        string_val: "./above_data_train/MARCOM.png"
        string_val: "./above_data_train/Amara_raja_logo.png"
        string_val: "./above_data_train/Mendocino_logo.png"
        string_val: "./above_data_train/Series+HD.png"
        string_val: "./above_data_train/Typo_cms_logo.png"
        string_val: "./above_data_train/Nova_Scotia_License_Plate.png"
        string_val: "./above_data_train/Explorair_Logo.png"
        string_val: "./above_data_train/Therupaulshow.png"
        string_val: "./above_data_train/Critter_Country_logo.svg.png"
        string_val: "./above_data_train/Leon_FF_logo.png"
        string_val: "./above_data_train/BowieStBulldogs.png"
        string_val: "./above_data_train/MakedonskoSonceLogo.png"
        string_val: "./above_data_train/Logo_of_JetSuiteX.png"
        string_val: "./above_data_train/Goanna-logo_thumb.png"
        string_val: "./above_data_train/ICC_U19_Cricket_World_Cup_logo.png"
        string_val: "./above_data_train/KTSA-AM_logo.png"
        string_val: "./above_data_train/RideKC_Streetcar_logo.svg.png"
        string_val: "./above_data_train/Priyadarshini_Engineering_College_logo.png"
        string_val: "./above_data_train/Bigdadalogo.png"
        string_val: "./above_data_train/K13XD_Prime_News_2003.png"
        string_val: "./above_data_train/Alianza_FC_(Panama).svg.png"
        string_val: "./above_data_train/WSMN_logo.png"
        string_val: "./above_data_train/Voyage_to_the_Iron_Reef.png"
        string_val: "./above_data_train/Six_Flags_Over_Texas_logo.png"
        string_val: "./above_data_train/SW_Slammers_Logo.png"
        string_val: "./above_data_train/CJGV-Groove-FM.png"
        string_val: "./above_data_train/Panegialios.png"
        string_val: "./above_data_train/MeltonMowbray.png"
        string_val: "./above_data_train/Team_Badge.png"
        string_val: "./above_data_train/Military_Order_of_the_Purple_Heart_logo.png"
        string_val: "./above_data_train/Colors_of_SCD.png"
        string_val: "./above_data_train/TangerOutletsSouthaven.png"
        string_val: "./above_data_train/2008_FIBA_Europe_Under-18_Championship_logo.png"
        string_val: "./above_data_train/Magic_star_series.png"
        string_val: "./above_data_train/UpT_Logo.png"
        string_val: "./above_data_train/HANCHEN_logo.png"
        string_val: "./above_data_train/Mills_Novelty_Logo.png"
        string_val: "./above_data_train/VfL_Neckerau_Mannheim.png"
        string_val: "./above_data_train/Gjensidige_NOR_logo.png"
        string_val: "./above_data_train/Mamoun_University_for_Science_and_Technology_logo.png"
        string_val: "./above_data_train/QuietRevLogo910.png"
        string_val: "./above_data_train/YWC_crest.svg.png"
        string_val: "./above_data_train/Toronto-BuffaloRoyalsWTTlogo.png"
        string_val: "./above_data_train/Lega_Piemont_Logo.png"
        string_val: "./above_data_train/E2C_LOGO_Master.png"
        string_val: "./above_data_train/University_of_Liep\304\201ja_logo.png"
        string_val: "./above_data_train/Cayman_Islands_Football_Association.svg.png"
        string_val: "./above_data_train/Home_center_middle.png"
        string_val: "./above_data_train/Matamata_Swifts_AFC.png"
        string_val: "./above_data_train/Tvland_awards1.png"
        string_val: "./above_data_train/Enterasys_logo_colorSM.png"
