node {
  name: "global_step/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "global_step"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global_step/Assign"
  op: "Assign"
  input: "global_step"
  input: "global_step/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global_step/read"
  op: "Identity"
  input: "global_step"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "IsVariableInitialized"
  op: "IsVariableInitialized"
  input: "global_step"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
}
node {
  name: "cond/Switch"
  op: "Switch"
  input: "IsVariableInitialized"
  input: "IsVariableInitialized"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "cond/switch_t"
  op: "Identity"
  input: "cond/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "cond/switch_f"
  op: "Identity"
  input: "cond/Switch"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "cond/pred_id"
  op: "Identity"
  input: "IsVariableInitialized"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "cond/read/Switch"
  op: "RefSwitch"
  input: "global_step"
  input: "cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "cond/read"
  op: "Identity"
  input: "cond/read/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "cond/Switch_1"
  op: "Switch"
  input: "global_step/Initializer/zeros"
  input: "cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "cond/Merge"
  op: "Merge"
  input: "cond/Switch_1"
  input: "cond/read"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "add/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "add"
  op: "Add"
  input: "cond/Merge"
  input: "add/y"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "Const"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1878
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
            size: 1878
          }
        }
        string_val: "./above_data_train/BC_Beroe_17_logo.png"
        string_val: "./above_data_train/Society_for_Information_Management_logo.png"
        string_val: "./above_data_train/UACCH-AR-logo.png"
        string_val: "./above_data_train/Logo_Wallabies.png"
        string_val: "./above_data_train/Erie_Lackawanna_Herald.png"
        string_val: "./above_data_train/Logo_The_Asia_Foundation.png"
        string_val: "./above_data_train/KinchBus.png"
        string_val: "./above_data_train/Android_KitKat_logo.png"
        string_val: "./above_data_train/Midnite_movies_logo.png"
        string_val: "./above_data_train/Bridgwater_Town_FC_logo.png"
        string_val: "./above_data_train/2010_World_Series_official_program.png"
        string_val: "./above_data_train/Wroxham_F.C.png"
        string_val: "./above_data_train/CKRN-TV.png"
        string_val: "./above_data_train/Coleg_Llysfasi_logo.png"
        string_val: "./above_data_train/Microtel_logo.png"
        string_val: "./above_data_train/Balmain_campus_logo1.png"
        string_val: "./above_data_train/Logo_of_the_Geological_Society_of_Glasgow.png"
        string_val: "./above_data_train/Rathkeale_College_logo.png"
        string_val: "./above_data_train/The_Joshua_Tree_Tour_2017_logo.png"
        string_val: "./above_data_train/Montana_Historical_Society_Logo.png"
        string_val: "./above_data_train/Dominion_Atlantic_Railway_herald.png"
        string_val: "./above_data_train/Air_Tahiti_Logo.png"
        string_val: "./above_data_train/Saralee-logo.png"
        string_val: "./above_data_train/Collingwood_boat_club_logo.png"
        string_val: "./above_data_train/Palisades_prep_2.png"
        string_val: "./above_data_train/Lend-lease-logo.png"
        string_val: "./above_data_train/Haryana_Steelers_Logo.png"
        string_val: "./above_data_train/Las_Vegas_Fabulous_Sin_City_Rollergirls.png"
        string_val: "./above_data_train/GUtech-Logo.png"
        string_val: "./above_data_train/Multimedia_University_logo.png"
        string_val: "./above_data_train/Bobfm939logo.png"
        string_val: "./above_data_train/Mukfellas.png"
        string_val: "./above_data_train/Vivo_por_Elena_logo.png"
        string_val: "./above_data_train/Club_Phusion_logo.png"
        string_val: "./above_data_train/Sovcomflot_logo.png"
        string_val: "./above_data_train/Ibn_Sina_Medical_College_Logo.png"
        string_val: "./above_data_train/MontrealWanderers.png"
        string_val: "./above_data_train/Dublin_Wheelers_Cycling_Club_(crest).png"
        string_val: "./above_data_train/Three_O\'Clock_Lobby_(logo).png"
        string_val: "./above_data_train/Frankfurt_Major_2015_logo.png"
        string_val: "./above_data_train/Pay_Less_Super_Markets_logo.png"
        string_val: "./above_data_train/Aaa_espn1.png"
        string_val: "./above_data_train/Korfball_Poland.png"
        string_val: "./above_data_train/Radiowave96.png"
        string_val: "./above_data_train/Australian_Criminal_Intelligence_Commission_logo.png"
        string_val: "./above_data_train/Oven_and_Shaker_logo.png"
        string_val: "./above_data_train/Maynards-Wine-Gums-Small.png"
        string_val: "./above_data_train/Optinmonster_logo.png"
        string_val: "./above_data_train/Logo_abrasevic.png"
        string_val: "./above_data_train/TK_Br\303\270vig_logo.png"
        string_val: "./above_data_train/Preply,_logo.png"
        string_val: "./above_data_train/Hama_University_Logo.png"
        string_val: "./above_data_train/Canal12_posadas.png"
        string_val: "./above_data_train/K13XD_Prime_News_2003.png"
        string_val: "./above_data_train/WSMN_logo.png"
        string_val: "./above_data_train/Opin_logo_en.png"
        string_val: "./above_data_train/Solvesborgspartiet.png"
        string_val: "./above_data_train/National_Physique_Committee_logo.png"
        string_val: "./above_data_train/HSG_Nordhorn.png"
        string_val: "./above_data_train/Logo_of_Saudia.png"
        string_val: "./above_data_train/Jhawklogo.png"
        string_val: "./above_data_train/KPPT-AM_790_The_Deuce_logo.png"
        string_val: "./above_data_train/Barys_Astana_Logo.png"
        string_val: "./above_data_train/Sobranie_Cocktail_cigarettes.png"
        string_val: "./above_data_train/KALE_logo.png"
        string_val: "./above_data_train/WHFS_1010_logo.png"
        string_val: "./above_data_train/OGS_Logo.png"
        string_val: "./above_data_train/Shepherd_University_seal.png"
        string_val: "./above_data_train/Chilhowie_Seal.png"
        string_val: "./above_data_train/Reinickendorfer_Fuchse.png"
        string_val: "./above_data_train/Discogs_logo.png"
        string_val: "./above_data_train/QTV-TV.png"
        string_val: "./above_data_train/CSHLlogo.png"
        string_val: "./above_data_train/Dominion-nfld.png"
        string_val: "./above_data_train/Ottawa_sens_logo_old.png"
        string_val: "./above_data_train/Germany_logo.png"
        string_val: "./above_data_train/Woodside-Valley-Estate-Logo-2014.png"
        string_val: "./above_data_train/Men_in_Black.png"
        string_val: "./above_data_train/Paramour_Logo_(Cirque_du_Soleil).png"
        string_val: "./above_data_train/CILS-FM.png"
        string_val: "./above_data_train/Ferns_N_Petals_Logo.png"
        string_val: "./above_data_train/Empires_logo.png"
        string_val: "./above_data_train/Polski_Cukier_Toru\305\204_logo.png"
        string_val: "./above_data_train/1649-Ang-Tamang-Daan.png"
        string_val: "./above_data_train/CARQUEST.png"
        string_val: "./above_data_train/Ccc-social-logo.png"
        string_val: "./above_data_train/Singer_Corporation_logo.png"
        string_val: "./above_data_train/Kitchee_SC_crest.png"
        string_val: "./above_data_train/West_Coast_Bank.png"
        string_val: "./above_data_train/Rugby_league_euro_fed.png"
        string_val: "./above_data_train/Illu_logo_OLVC.png"
        string_val: "./above_data_train/CAMCHSC.png"
        string_val: "./above_data_train/Bosascollogo.png"
        string_val: "./above_data_train/Centro_Ique\303\261o_-_peruvian_football_club.png"
        string_val: "./above_data_train/Franklin_County,_Missouri_seal.png"
        string_val: "./above_data_train/Sweden_rugby.png"
        string_val: "./above_data_train/City_of_dallas_logo.png"
        string_val: "./above_data_train/Flurry_logo.png"
        string_val: "./above_data_train/BBA4_logo.png"
        string_val: "./above_data_train/CNP_logo,_respresent_the_Certified_Network_Professional_program_by_the_NPA.png"
        string_val: "./above_data_train/Michigan_Bell.png"
        string_val: "./above_data_train/Evangelical_Lutheran_Church_of_Papua_New_Guinea_Logo.png"
        string_val: "./above_data_train/LakemoreOhioSeal.png"
        string_val: "./above_data_train/Aapas_ki_baat.png"
        string_val: "./above_data_train/Minto_crest.png"
        string_val: "./above_data_train/Auto-Alliance-Logo.png"
        string_val: "./above_data_train/WHJJ_new_logo.png"
        string_val: "./above_data_train/Radio_Antilles_logo.png"
        string_val: "./above_data_train/Cullompton_Rangers_F.C._logo.png"
        string_val: "./above_data_train/Corrymeela_logo.png"
        string_val: "./above_data_train/Globenewlogo.png"
        string_val: "./above_data_train/Adelaide_500_logo.png"
        string_val: "./above_data_train/WENY36.png"
        string_val: "./above_data_train/KVNA-AM.png"
        string_val: "./above_data_train/Elephant_House_logo.png"
        string_val: "./above_data_train/London-Marathon-2011-logo.png"
        string_val: "./above_data_train/KollegStBlasien.png"
        string_val: "./above_data_train/WDXC-FM_2016.png"
        string_val: "./above_data_train/Carnet1.png"
        string_val: "./above_data_train/Avenida_brasil_logo.png"
        string_val: "./above_data_train/Center_Harbor_Town_Seal.png"
        string_val: "./above_data_train/Donegal_Democrat_Logo.png"
        string_val: "./above_data_train/GunstockMountainResort_GilfordNH_LOGO.png"
        string_val: "./above_data_train/British_National_Party.png"
        string_val: "./above_data_train/Protestant_Church_in_Sabah_logo.png"
        string_val: "./above_data_train/Radio_96.1_Logo.png"
        string_val: "./above_data_train/Department_of_Agriculture_(Australia,_2013\342\200\22315)_logo.png"
        string_val: "./above_data_train/Australian_Labor_Party_(Victorian_Branch)_logo.png"
        string_val: "./above_data_train/CEFCU_Logo_2PMS_Tag.png"
        string_val: "./above_data_train/BerlinNHseal.png"
        string_val: "./above_data_train/Mount_St_Michael\'s_College_logo.png"
        string_val: "./above_data_train/Lorenzo_Ruiz_de_Manila_School_logo.png"
        string_val: "./above_data_train/Shahzanmudasclogo.png"
        string_val: "./above_data_train/NEWSWATCH_LOGO.png"
        string_val: "./above_data_train/E-square.png"
        string_val: "./above_data_train/NWLL_logo.png"
        string_val: "./above_data_train/Federa\303\247\303\243o_Angolana_de_Basquetebol_(logo).png"
        string_val: "./above_data_train/Chicago_Area_Rugby_Football_Union_(logo).png"
        string_val: "./above_data_train/Bayugan-city-ph-seal.png"
        string_val: "./above_data_train/JoeComColBang.png"
        string_val: "./above_data_train/Arles2010logo.png"
        string_val: "./above_data_train/Stickin\'_Around_logo.png"
        string_val: "./above_data_train/Pacific_Aviation_Museum_Pearl_Harbor_Logo.png"
        string_val: "./above_data_train/6abc_IKEA_Thanksgiving_Day_Parade.png"
        string_val: "./above_data_train/Logo_of_Consumer_Electronics_Show.png"
        string_val: "./above_data_train/Mount_Allison_University_Seal.png"
        string_val: "./above_data_train/Fabmart_NewLogo.png"
        string_val: "./above_data_train/Indigenous_Environmental_Network_logo.png"
        string_val: "./above_data_train/Girabola_Zap_2_Logo.png"
        string_val: "./above_data_train/Warrior_Dog_Foundation_logo.png"
        string_val: "./above_data_train/Mrs._Butterworth\'s_Logo.png"
        string_val: "./above_data_train/Paradisehotel2.png"
        string_val: "./above_data_train/Doxalitalia.png"
        string_val: "./above_data_train/Bigla_Cycling_Team_logo.png"
        string_val: "./above_data_train/KZZI_logo.png"
        string_val: "./above_data_train/IHSAOriginalMarchLogo.png"
        string_val: "./above_data_train/Middle_Rio_Grande_Conservancy_District_logo.png"
        string_val: "./above_data_train/SSV_Aalen_logo.png"
        string_val: "./above_data_train/Portland_International_Jetport_Logo.png"
        string_val: "./above_data_train/KBAK29.png"
        string_val: "./above_data_train/St.._Albert_Steel_Logo.png"
        string_val: "./above_data_train/21._kooli_logo.png"
        string_val: "./above_data_train/Taxpayers\'_Alliance_logo.png"
        string_val: "./above_data_train/Xm_cafe.png"
        string_val: "./above_data_train/Wacamplogo.png"
        string_val: "./above_data_train/Horsens_IC_logo.png"
        string_val: "./above_data_train/Lillehammer_Olympiapark_logo.png"
        string_val: "./above_data_train/Weebeastie.png"
        string_val: "./above_data_train/SANSA_logo.png"
        string_val: "./above_data_train/Kyunghyang_Shinmun_logo.png"
        string_val: "./above_data_train/Grumman_1976_logo.png"
        string_val: "./above_data_train/Kdbc_2012.png"
        string_val: "./above_data_train/Tripura_University_logo.png"
        string_val: "./above_data_train/WAUD-AM_logo2.png"
        string_val: "./above_data_train/Njccrest.png"
        string_val: "./above_data_train/Speedweeks_logo.png"
        string_val: "./above_data_train/Jefferson_County_tx_seal.png"
        string_val: "./above_data_train/McCormickTractorsLogo.png"
        string_val: "./above_data_train/WebSideStory.png"
        string_val: "./above_data_train/SelhurstHighOriginalG.png"
        string_val: "./above_data_train/Kingdom_of_Libya_Airlines_logo.png"
        string_val: "./above_data_train/Unish-Kuri.png"
        string_val: "./above_data_train/Tamil_Vision_International_Logo.png"
        string_val: "./above_data_train/Homestead_Book_Company_Logo.png"
        string_val: "./above_data_train/Escrava01jpg.png"
        string_val: "./above_data_train/Subhiksha_logo.png"
        string_val: "./above_data_train/S\303\251paq_logo.png"
        string_val: "./above_data_train/Logo_2016_women_bandy_wc.png"
        string_val: "./above_data_train/Matrixbt_logo.png"
        string_val: "./above_data_train/Sampledutchg.png"
        string_val: "./above_data_train/Des_Moines_Capitols_Color_Logo.png"
        string_val: "./above_data_train/Report_sml.png"
        string_val: "./above_data_train/University_of_Jos_logo.png"
        string_val: "./above_data_train/Davenport_Panthers_logo.png"
        string_val: "./above_data_train/KCC-logo.png"
        string_val: "./above_data_train/ShauryaSuhani.png"
        string_val: "./above_data_train/MovieTickets.com_Official_Logo,_2015.png"
        string_val: "./above_data_train/NMHS-logo.png"
        string_val: "./above_data_train/FromTheBalconyLogo.png"
        string_val: "./above_data_train/Enerflex_logo.png"
        string_val: "./above_data_train/Popjapantv-logo.png"
        string_val: "./above_data_train/KUILFox64.png"
        string_val: "./above_data_train/Babbar_Khalsa_International_logo_variation.png"
        string_val: "./above_data_train/Logo_env_1.png"
        string_val: "./above_data_train/Calgary_Pride.png"
        string_val: "./above_data_train/Mulholland_Logo.png"
        string_val: "./above_data_train/Sunshine_Coast_Falcons_logo.png"
        string_val: "./above_data_train/FV_Bad_Vilbel.png"
        string_val: "./above_data_train/DIYorg-logo.png"
        string_val: "./above_data_train/Plattling_Black_Hawks.png"
        string_val: "./above_data_train/MinistryEducationCultureScience.png"
        string_val: "./above_data_train/Cardiff_Design_Festival_07.png"
        string_val: "./above_data_train/ESClogo.png"
        string_val: "./above_data_train/Leichhardt_Council_Logo.png"
        string_val: "./above_data_train/C-Restaurant-logo-2014.png"
        string_val: "./above_data_train/NewMexicoStars.png"
        string_val: "./above_data_train/Planetdinosaurtitle.png"
        string_val: "./above_data_train/Fisk_University_logo.png"
        string_val: "./above_data_train/Dutch_Windmills_logo.png"
        string_val: "./above_data_train/Phrack.png"
        string_val: "./above_data_train/Techguy2.png"
        string_val: "./above_data_train/Edmark_logo.png"
        string_val: "./above_data_train/Danube_University_Krems_Logo.png"
        string_val: "./above_data_train/Glostrup_IC.png"
        string_val: "./above_data_train/Logo_Tonga_Rugby.png"
        string_val: "./above_data_train/KLAMlogo2.png"
        string_val: "./above_data_train/Ascend_Federal_Credit_Union_Logo.png"
        string_val: "./above_data_train/Russian_Standard_Bank_Logo.png"
        string_val: "./above_data_train/BainbridgeCSeal.png"
        string_val: "./above_data_train/RailersPBL.png"
        string_val: "./above_data_train/Latvia_national_rugby_league_team_logo.png"
        string_val: "./above_data_train/Utah_Airways_Logo.png"
        string_val: "./above_data_train/LogoMetroLigero.png"
        string_val: "./above_data_train/WSFL_2008_Logo.png"
        string_val: "./above_data_train/Robins_Donuts.png"
        string_val: "./above_data_train/Tandberg_Storage_logo.png"
        string_val: "./above_data_train/BillyAndMandy.png"
        string_val: "./above_data_train/HobartWilliamSmithathletics.png"
        string_val: "./above_data_train/Thunder.png"
        string_val: "./above_data_train/Kaguya_mark.png"
        string_val: "./above_data_train/Keysborough_College_Logo.png"
        string_val: "./above_data_train/Al_Jazeera_Mubasher.png"
        string_val: "./above_data_train/Casper_College_logo.png"
        string_val: "./above_data_train/2007_JAPAN_SERIES.png"
        string_val: "./above_data_train/Cathay_Bank_logo.png"
        string_val: "./above_data_train/T\303\251l\303\251-Annonces.png"
        string_val: "./above_data_train/CKCE-FM.png"
        string_val: "./above_data_train/Gurren-english.png"
        string_val: "./above_data_train/Department_of_Space_logo.png"
        string_val: "./above_data_train/Alerton.png"
        string_val: "./above_data_train/InvictaInternationalLogo.png"
        string_val: "./above_data_train/2002NBAFinals.png"
        string_val: "./above_data_train/Smith_Corona_Logo.png"
        string_val: "./above_data_train/Forest_Industries_Telecommunications_logo.png"
        string_val: "./above_data_train/The_National_Film_and_Television_School_Logo.png"
        string_val: "./above_data_train/Big_Brother_Sverige.png"
        string_val: "./above_data_train/Code_Club_logo.png"
        string_val: "./above_data_train/Angkasa_Pura_logo_2011.png"
        string_val: "./above_data_train/Dom-Hotel_logo.png"
        string_val: "./above_data_train/Saltlakepotash.png"
        string_val: "./above_data_train/NHSF_(UK)_logo.png"
        string_val: "./above_data_train/Logo_of_Jabong.png"
        string_val: "./above_data_train/Anjunabeats_logo.png"
        string_val: "./above_data_train/Mablogob.png"
        string_val: "./above_data_train/BBC_News_titles.png"
        string_val: "./above_data_train/RT\303\211_Network_Ltd.png"
        string_val: "./above_data_train/Peruvian_millionaire_logo.png"
        string_val: "./above_data_train/KFLY-FM.png"
        string_val: "./above_data_train/Government_College_of_Engineering,_Chandrapur_logo.png"
        string_val: "./above_data_train/Remix_OS_logo.png"
        string_val: "./above_data_train/FMOD_logo.png"
        string_val: "./above_data_train/Western_Cape_Provincial_Parliament_emblem.png"
        string_val: "./above_data_train/INET_Logo.png"
        string_val: "./above_data_train/Z_Rock_logo.png"
        string_val: "./above_data_train/PlusTV.png"
        string_val: "./above_data_train/HulaBowl2018.png"
        string_val: "./above_data_train/LisbonCTseal.png"
        string_val: "./above_data_train/Conanshow.png"
        string_val: "./above_data_train/Greater_Sudbury_Police_Service_Logo.png"
        string_val: "./above_data_train/Telecom_Infra_Project.png"
        string_val: "./above_data_train/Lto-logo.png"
        string_val: "./above_data_train/Pcnc.png"
        string_val: "./above_data_train/Logo_of_Aboriginal_Affairs_NSW_2009.png"
        string_val: "./above_data_train/Icon_Avengers.png"
        string_val: "./above_data_train/FIBA_Oceania_logo.png"
        string_val: "./above_data_train/Eesti_Energia_logo.png"
        string_val: "./above_data_train/CB_Conquero_logo.png"
        string_val: "./above_data_train/2003_MLS_All-Star_Game_logo.png"
        string_val: "./above_data_train/Charles_M._Schulz_-_Sonoma_County_Airport_(logo).png"
        string_val: "./above_data_train/City_of_Broadmeadows_Logo.png"
        string_val: "./above_data_train/WKIK-FM.png"
        string_val: "./above_data_train/Walt_Disney_Animation_Studios_logo.png"
        string_val: "./above_data_train/Addax_Team_(logo).png"
        string_val: "./above_data_train/Busan_KT_Sonicboom.png"
        string_val: "./above_data_train/Broward_College_Logo.png"
        string_val: "./above_data_train/DowningtownSTEM.png"
        string_val: "./above_data_train/InternationalInstituteOfBusinessAnalysis.png"
        string_val: "./above_data_train/Lincoln_Capitols.png"
        string_val: "./above_data_train/Savannah_Sand_Gnats.png"
        string_val: "./above_data_train/Western_Alamance_School_Logo.png"
        string_val: "./above_data_train/Wild_1075_Portland.png"
        string_val: "./above_data_train/CHR_logo.png"
        string_val: "./above_data_train/Arabian_Gulf_University_logo.png"
        string_val: "./above_data_train/Westernbank.png"
        string_val: "./above_data_train/PBA2012-13_commscup.png"
        string_val: "./above_data_train/London_Colney_F.C._logo.png"
        string_val: "./above_data_train/Ekhanei.com_logo.png"
        string_val: "./above_data_train/Holy_Spirit_School_of_Tagbilaran_logo.png"
        string_val: "./above_data_train/University_of_Hafr_Albatin_seal.png"
        string_val: "./above_data_train/UofT_Logo.png"
        string_val: "./above_data_train/National_Rail_Chaplaincy_Service_(logo).png"
        string_val: "./above_data_train/Recreativo_de_Huelva.png"
        string_val: "./above_data_train/Adelaide_36ers_logo.png"
        string_val: "./above_data_train/Seine_River_First_Nations_Logo.png"
        string_val: "./above_data_train/Suffolk_County,_NY_Police_Aviation_-_Wiki.png"
        string_val: "./above_data_train/American_Academy_of_Larnaca_(shield).png"
        string_val: "./above_data_train/UniversityAlicanteSeal.png"
        string_val: "./above_data_train/Ithaca_Tompkins_Regional_Airport_(logo).png"
        string_val: "./above_data_train/HighParkDemons.png"
        string_val: "./above_data_train/Glasgow_Roller_Derby_3_Color_Logo.png"
        string_val: "./above_data_train/Taco_Bell_2016.png"
        string_val: "./above_data_train/Arameisk-Syrianska_logo.png"
        string_val: "./above_data_train/Air_Burundi_logo.png"
        string_val: "./above_data_train/KDVR31.png"
        string_val: "./above_data_train/London-Symphony-Orchestra-classic-rock.png"
        string_val: "./above_data_train/Southern_Utah_Thunderbirds_logo.png"
        string_val: "./above_data_train/Duke-Shield-Nicholas.png"
        string_val: "./above_data_train/ITV3_HD.png"
        string_val: "./above_data_train/Anyang_University_UI.png"
        string_val: "./above_data_train/DanceX_(logo).png"
        string_val: "./above_data_train/James_Ready_logo.png"
        string_val: "./above_data_train/Terrebonne_Cobras.png"
        string_val: "./above_data_train/WREK_Logo.png"
        string_val: "./above_data_train/Twisted_Timbers_Logo.png"
        string_val: "./above_data_train/2012NECBasketballTournament.png"
        string_val: "./above_data_train/California_State_University,_Fullerton_logo.png"
        string_val: "./above_data_train/Unicorns_of_Love.png"
        string_val: "./above_data_train/Prior_logo.png"
        string_val: "./above_data_train/Cyprus_Space_Exploration_Organisation_-_Logo_-_Sep_2016.png"
        string_val: "./above_data_train/Badgerline.png"
        string_val: "./above_data_train/Susar_logo.png"
        string_val: "./above_data_train/Russian_Venture_Company_logo.png"
        string_val: "./above_data_train/Philracom_logo.png"
        string_val: "./above_data_train/KZAS-LP_logo.png"
        string_val: "./above_data_train/L5_Society_(logo).png"
        string_val: "./above_data_train/2014_Euroleague_Final_Four_logo.png"
        string_val: "./above_data_train/Acacia_logo.png"
        string_val: "./above_data_train/CHS-SCHlogo.png"
        string_val: "./above_data_train/EA_Tiburon_Logo.png"
        string_val: "./above_data_train/Wjar_dt2_2009.png"
        string_val: "./above_data_train/Swan_hunter.png"
        string_val: "./above_data_train/Ballerin_crest.png"
        string_val: "./above_data_train/Snowbird_Airlines_logo.png"
        string_val: "./above_data_train/Santa_Gema_FC.png"
        string_val: "./above_data_train/Naval_Air_Station_Wildwood_Aviation_Museum_Logo.png"
        string_val: "./above_data_train/FocolareMovement.png"
        string_val: "./above_data_train/Project_Crimson_logo.png"
        string_val: "./above_data_train/Clemson_Area_Transit_Cat_Bus_Logo.png"
        string_val: "./above_data_train/Fpm_index_logo2.png"
        string_val: "./above_data_train/Tostitos_Logo.png"
        string_val: "./above_data_train/Knue_stork.png"
        string_val: "./above_data_train/Candu_logo.png"
        string_val: "./above_data_train/Glamorganarms.png"
        string_val: "./above_data_train/Trygdeetaten.png"
        string_val: "./above_data_train/Logo_for_the_DO-IT_Center,_University_of_Washington.png"
        string_val: "./above_data_train/GEOS_logo.png"
        string_val: "./above_data_train/Dallas_Cowboys_navy_uniform.png"
        string_val: "./above_data_train/WLOR-AM_Sunny_radio_logo.png"
        string_val: "./above_data_train/Indian_Ocean_Tuna_Commission.png"
        string_val: "./above_data_train/PDPLogo.png"
        string_val: "./above_data_train/CARDINAL-OHARA1.png"
        string_val: "./above_data_train/Okanagan_Mission_Secondary_School_logo.png"
        string_val: "./above_data_train/Granada_Television.png"
        string_val: "./above_data_train/CanGames_emblem.png"
        string_val: "./above_data_train/Bink_logo.png"
        string_val: "./above_data_train/Logo_of_Perth_Arena.png"
        string_val: "./above_data_train/Primeira_Liga_(Brazil).png"
        string_val: "./above_data_train/Bolder_Media_Wow!_Wow!_Wubbzy!_Wubbzy\'s_Big_Movie_Logo.png"
        string_val: "./above_data_train/Sirius_XM_POTUS.png"
        string_val: "./above_data_train/2005_Grand_National_logo.png"
        string_val: "./above_data_train/WIQH-FM_logo.png"
        string_val: "./above_data_train/F.C._Fidene_logo.png"
        string_val: "./above_data_train/VIFF_2014_logo_medium.png"
        string_val: "./above_data_train/Alabama_Dealer_Motorcycle.png"
        string_val: "./above_data_train/MVV_Maastricht.png"
        string_val: "./above_data_train/Sontinh_Original_Ruou-Logo-2015.png"
        string_val: "./above_data_train/Channel_V_Philippines_1999.png"
        string_val: "./above_data_train/PSL_Beach_Volleyball_2016.png"
        string_val: "./above_data_train/Jernhusen_logo.png"
        string_val: "./above_data_train/MiddleburyLogo.png"
        string_val: "./above_data_train/CCF_logo.png"
        string_val: "./above_data_train/CityFlyerExpress.png"
        string_val: "./above_data_train/Babcock_Logo.png"
        string_val: "./above_data_train/2012_Sukma_Games_Mascot.png"
        string_val: "./above_data_train/VGTU_seal.png"
        string_val: "./above_data_train/Glo_jeans_(logo).png"
        string_val: "./above_data_train/Association_of_Vermont_Credit_Unions.png"
        string_val: "./above_data_train/Kryogenifex_logo.png"
        string_val: "./above_data_train/150px-BroughSuperiorlogo.png"
        string_val: "./above_data_train/SarasaviyaAward.png"
        string_val: "./above_data_train/National_Research_University_Higher_School_of_Economics_logo.png"
        string_val: "./above_data_train/SM-logo_kilpi_rgb.png"
        string_val: "./above_data_train/College_of_Eastern_Idaho_logo.png"
        string_val: "./above_data_train/Cox4.png"
        string_val: "./above_data_train/British_Muslim_TV_logo.png"
        string_val: "./above_data_train/NowBNC_logo.png"
        string_val: "./above_data_train/West_Coast_Fever.png"
        string_val: "./above_data_train/UST_Seal.png"
        string_val: "./above_data_train/Devon_Cornwall_Police_logo.png"
        string_val: "./above_data_train/SteelCityMenace.png"
        string_val: "./above_data_train/Penzu_Logo.png"
        string_val: "./above_data_train/Brooks_AB_Seal.png"
        string_val: "./above_data_train/Western_Power_Distribution.png"
        string_val: "./above_data_train/Devils_Peak_Brewing_Company_Logo.png"
        string_val: "./above_data_train/WCIR-FM_2009.png"
        string_val: "./above_data_train/Schweppes_logo.png"
        string_val: "./above_data_train/Textil_mandiyu.png"
        string_val: "./above_data_train/West_Bromwich_Building_Society.png"
        string_val: "./above_data_train/Portland_Thunder_helmet_1975.png"
        string_val: "./above_data_train/BiloxiShuckersCapLogo.png"
        string_val: "./above_data_train/Surigao_Educaition_Center_Logo.png"
        string_val: "./above_data_train/Centroamericano2001.png"
        string_val: "./above_data_train/Pharmafabrik_Logo.png"
        string_val: "./above_data_train/Banner_home_logo_about.png"
        string_val: "./above_data_train/CityofSeaTacLOGO.png"
        string_val: "./above_data_train/ViewVC_logo.png"
        string_val: "./above_data_train/Logo_Dubai_College.png"
        string_val: "./above_data_train/Aker_Seafoods_Logo.png"
        string_val: "./above_data_train/Laverda.png"
        string_val: "./above_data_train/KAEF_Logo.png"
        string_val: "./above_data_train/Laragh_United_GFC_Crest.png"
        string_val: "./above_data_train/1999frozenfour.png"
        string_val: "./above_data_train/I-League_logo.png"
        string_val: "./above_data_train/KMHK-FM.png"
        string_val: "./above_data_train/El-Rey-Del-Mundo.png"
        string_val: "./above_data_train/BM_Sagunto.png"
        string_val: "./above_data_train/STV_HD_2014.png"
        string_val: "./above_data_train/Asociaci\303\263n_de_Scouts_de_Cuba_1940s.png"
        string_val: "./above_data_train/MiLB_logo.png"
        string_val: "./above_data_train/Lanica_logo.png"
        string_val: "./above_data_train/Holy_Trinity_Catholic_High_School(Simcoe)_Logo.png"
        string_val: "./above_data_train/American_University_of_the_Middle_East_(AUM).png"
        string_val: "./above_data_train/Forgotten_Realms_logo.png"
        string_val: "./above_data_train/Cowes_Sports_F.C._logo.png"
        string_val: "./above_data_train/KTN_News_logo.png"
        string_val: "./above_data_train/Wbek_logo.png"
        string_val: "./above_data_train/Giants_N\303\266rdlingen_logo.png"
        string_val: "./above_data_train/Field_Move_logo.png"
        string_val: "./above_data_train/The_Movie_Channel_1988.png"
        string_val: "./above_data_train/Adsense_rebranded_with_a_new_logo.png"
        string_val: "./above_data_train/Qingdao_University_banner.png"
        string_val: "./above_data_train/Real_Art_Logo.png"
        string_val: "./above_data_train/Fisher_Mall_Logo.png"
        string_val: "./above_data_train/Russneft_Logo.png"
        string_val: "./above_data_train/VykeBusiness_Logo.png"
        string_val: "./above_data_train/Plunket.png"
        string_val: "./above_data_train/Saddleback_Church_logo.png"
        string_val: "./above_data_train/FreedomPlus-logo-2013-814x180.png"
        string_val: "./above_data_train/French_Basketball_Cup_logo.png"
        string_val: "./above_data_train/Hokusei_Gakuen_University_Logo.png"
        string_val: "./above_data_train/Banshee_(KI)_Logo.png"
        string_val: "./above_data_train/The_Tide_Newspaper_logo.png"
        string_val: "./above_data_train/KLIN_logo.png"
        string_val: "./above_data_train/Code_Blocks_logo.png"
        string_val: "./above_data_train/GameshowMarathon2007.png"
        string_val: "./above_data_train/Sheffield_High_School_Emblem.png"
        string_val: "./above_data_train/Cornwallfrsbadge.png"
        string_val: "./above_data_train/Germania_Wiesbaden.png"
        string_val: "./above_data_train/Brandeis_University_seal.png"
        string_val: "./above_data_train/Lottery_logo.png"
        string_val: "./above_data_train/Swazi_logo.png"
        string_val: "./above_data_train/SSAkragas.png"
        string_val: "./above_data_train/School_of_the_EpiphanyLogo.png"
        string_val: "./above_data_train/Malibu_Comics_logo.png"
        string_val: "./above_data_train/Nazrul_Institute_Logo.png"
        string_val: "./above_data_train/HoumaConquerors.png"
        string_val: "./above_data_train/Reflex_Paramoteur_logo.png"
        string_val: "./above_data_train/Yaziza.png"
        string_val: "./above_data_train/ETI_LOGO_4COL.png"
        string_val: "./above_data_train/SciELOlogo.png"
        string_val: "./above_data_train/2008PreaknessLogo.png"
        string_val: "./above_data_train/Danelectro_logo.png"
        string_val: "./above_data_train/General-Magic-Logo.png"
        string_val: "./above_data_train/The_movie_channel_uk_logo_1990.png"
        string_val: "./above_data_train/Commercial_international_bank_CIB_logo_latest.png"
        string_val: "./above_data_train/WelshFactor_logo.png"
        string_val: "./above_data_train/Sreegopal_Banerjee_College.png"
        string_val: "./above_data_train/Night_Tracks_logo_blue.png"
        string_val: "./above_data_train/WXND-LP_logo.png"
        string_val: "./above_data_train/Covenant_party_CNMI_logo.png"
        string_val: "./above_data_train/Bad_Reichenhall_RL.png"
        string_val: "./above_data_train/Womclogo.png"
        string_val: "./above_data_train/Wpbf_2010.png"
        string_val: "./above_data_train/Bovislogo.png"
        string_val: "./above_data_train/WTUV-FM_logo.png"
        string_val: "./above_data_train/Anna-Schmidt-Schule.png"
        string_val: "./above_data_train/IACoS.png"
        string_val: "./above_data_train/G7_2016_Shima_Logo.png"
        string_val: "./above_data_train/JohnsonCityCardinalsCapLogo.png"
        string_val: "./above_data_train/Naples_Municipal_Airport_(emblem).png"
        string_val: "./above_data_train/Logo_of_the_Canadian_Medical_and_Biological_Engineering_Society.png"
        string_val: "./above_data_train/Manningham_United_Logo.png"
        string_val: "./above_data_train/Semper_Solaris_Logo.png"
        string_val: "./above_data_train/IUP_Bear.png"
        string_val: "./above_data_train/The_Gossip_Table_logo.png"
        string_val: "./above_data_train/Dirty_Money_The_Story_of_the_Criminal_Assets_Bureau.png"
        string_val: "./above_data_train/Grameephone_Logo.png"
        string_val: "./above_data_train/MeTV_WBND.png"
        string_val: "./above_data_train/Merley_Cobham_Sports_F.C._logo.png"
        string_val: "./above_data_train/Camelliait.png"
        string_val: "./above_data_train/KMHL.png"
        string_val: "./above_data_train/Delta-academies-trust-logo.png"
        string_val: "./above_data_train/Haifaff_logo_eng.png"
        string_val: "./above_data_train/Foreign_Languages_Publishing_House_(Soviet_Union).png"
        string_val: "./above_data_train/Central_F.C.png"
        string_val: "./above_data_train/Gabrielle-roy_school_logo.png"
        string_val: "./above_data_train/APSRTC_Logo.png"
        string_val: "./above_data_train/ShaheenCollegeLogo.png"
        string_val: "./above_data_train/Poweroffivelogo.png"
        string_val: "./above_data_train/NationalUniversityofSingapore.png"
        string_val: "./above_data_train/Shire_of_Tammin_Logo.png"
        string_val: "./above_data_train/Logo_Dodwell_&_Co.png"
        string_val: "./above_data_train/British-German_Association_Logo.png"
        string_val: "./above_data_train/Maricourt_Catholic_High_School_Crest.png"
        string_val: "./above_data_train/KOOL1071.png"
        string_val: "./above_data_train/Sun_Country_Airlines_Logo.png"
        string_val: "./above_data_train/Logo_Women\'s_World_Open_2007.png"
        string_val: "./above_data_train/Singapore_Cup_logo.png"
        string_val: "./above_data_train/Momondo_A-S_logo.png"
        string_val: "./above_data_train/Logo_of_Laver_Cup.png"
        string_val: "./above_data_train/RBS_International.png"
        string_val: "./above_data_train/IMPACTLogo.png"
        string_val: "./above_data_train/Dorsey_Emmet\'s_Gaelic_Football_Club_logo.png"
        string_val: "./above_data_train/BaldwinHillsLogo3.png"
        string_val: "./above_data_train/Empas_logo.png"
        string_val: "./above_data_train/ULSTR350.png"
        string_val: "./above_data_train/WAWB.png"
        string_val: "./above_data_train/FWB-logo.png"
        string_val: "./above_data_train/Fma-nz-logo.png"
        string_val: "./above_data_train/SD_Lenense.png"
        string_val: "./above_data_train/International_Broadcasting_Union,_logo_(1939-1945).png"
        string_val: "./above_data_train/Ulaanbaatar_City_FC_Logo.png"
        string_val: "./above_data_train/Seal_of_Unionville,_North_Carolina.png"
        string_val: "./above_data_train/ChannelV_PH_Logo.png"
        string_val: "./above_data_train/Rocky_Mountain_Athletic_Conference_logo.png"
        string_val: "./above_data_train/UTour_logo_dark_url.png"
        string_val: "./above_data_train/Holy_Ghost_Preparatory_School_(crest).png"
        string_val: "./above_data_train/Pass_Plus_Logo.png"
        string_val: "./above_data_train/Yarroweyah_Football_Club_logo.png"
        string_val: "./above_data_train/KPAT-FM.png"
        string_val: "./above_data_train/Grupo_CIE_logo.png"
        string_val: "./above_data_train/11th_latin_grammy.png"
        string_val: "./above_data_train/Former_cmc_official_logo.png"
        string_val: "./above_data_train/ADST_Logo_2017.png"
        string_val: "./above_data_train/BuffaloStampede.png"
        string_val: "./above_data_train/WashingtonWarriors.png"
        string_val: "./above_data_train/Ao.com_logo.png"
        string_val: "./above_data_train/Lsc-o_seal.png"
        string_val: "./above_data_train/Maitland_High_School_logo.png"
        string_val: "./above_data_train/E-470.png"
        string_val: "./above_data_train/RadarOnline_Logo.png"
        string_val: "./above_data_train/KNTH_Old.png"
        string_val: "./above_data_train/DakotaStU.png"
        string_val: "./above_data_train/SBS_2_2015_logo.png"
        string_val: "./above_data_train/Kazimieras_Simonavi\304\215ius_University_logo.png"
        string_val: "./above_data_train/Reality_of_wrestling_logo.png"
        string_val: "./above_data_train/DC_Comics_logo_2005\342\200\2232012.png"
        string_val: "./above_data_train/Ghana_BBall_Association.png"
        string_val: "./above_data_train/Black_Family_Channel.png"
        string_val: "./above_data_train/Parsian_Bank_logo.png"
        string_val: "./above_data_train/ToysForBob.png"
        string_val: "./above_data_train/Reptoncrest.png"
        string_val: "./above_data_train/Sakura_(cigarette).png"
        string_val: "./above_data_train/Alcester_Town_F.C.png"
        string_val: "./above_data_train/Jekyll_2007_title_card.png"
        string_val: "./above_data_train/Pasemilogo.png"
        string_val: "./above_data_train/Edmonton_Indy_Logo.png"
        string_val: "./above_data_train/Toho_Bank_logo.png"
        string_val: "./above_data_train/Dentalschoollogo.png"
        string_val: "./above_data_train/WGMD_small_logo.png"
        string_val: "./above_data_train/National_Women\'s_Basketball_League.png"
        string_val: "./above_data_train/Antero_resources_logo_2017.png"
        string_val: "./above_data_train/SC_1880_Frankfurt.png"
        string_val: "./above_data_train/Logo_of_Coachella_Valley_Mountains_Conservancy.png"
        string_val: "./above_data_train/HM_Government.png"
        string_val: "./above_data_train/Avenues_United.png"
        string_val: "./above_data_train/Saurashtra_University_Emblem.png"
        string_val: "./above_data_train/Nacionalguadalajara.png"
        string_val: "./above_data_train/Strava_Logo.png"
        string_val: "./above_data_train/KK_Mega_Vizura_Logo_2014.png"
        string_val: "./above_data_train/Aware_Records.png"
        string_val: "./above_data_train/St_Ann\'s_Rangers.png"
        string_val: "./above_data_train/Richmondbcflag.png"
        string_val: "./above_data_train/National_Union_of_Students_UK_logo.png"
        string_val: "./above_data_train/St_John\'s_College,_University_of_Sydney_coat_of_arms.png"
        string_val: "./above_data_train/WMJD-FM_2014.png"
        string_val: "./above_data_train/Lotto_649_logo.png"
        string_val: "./above_data_train/GOZOCOATOFARMS.png"
        string_val: "./above_data_train/Valhalla-Logo.png"
        string_val: "./above_data_train/Cassella_logo.png"
        string_val: "./above_data_train/Odfjell_Drilling_logo.png"
        string_val: "./above_data_train/Siggiewifclogo.png"
        string_val: "./above_data_train/CSM_Satu_Mare_logo.png"
        string_val: "./above_data_train/Mediacorp_arts_central_logo.png"
        string_val: "./above_data_train/HuHot_Mongolian_Grill_logo.png"
        string_val: "./above_data_train/Hightdtown_Rams.png"
        string_val: "./above_data_train/WXLT.png"
        string_val: "./above_data_train/Royce_logo.png"
        string_val: "./above_data_train/StJoeIndia.png"
        string_val: "./above_data_train/Monster_Raving_Loony_Party.png"
        string_val: "./above_data_train/Vesuvius_plc_logo.png"
        string_val: "./above_data_train/WinchesterCTseal.png"
        string_val: "./above_data_train/RohnertParkLogoEd2662.png"
        string_val: "./above_data_train/Isotopia_logo.png"
        string_val: "./above_data_train/NewFactorLogo.png"
        string_val: "./above_data_train/Sunwell_deepchill_logo_pumpable_slurry_ice.png"
        string_val: "./above_data_train/Furitechnics.png"
        string_val: "./above_data_train/Sichuan_FAW_Toyota_Motor_logo.png"
        string_val: "./above_data_train/Goldplatecard.png"
        string_val: "./above_data_train/TechonomyMediaLogo.png"
        string_val: "./above_data_train/HalifaxRainmen.png"
        string_val: "./above_data_train/Richmond_Theatre_logo.png"
        string_val: "./above_data_train/Manitoba_Human_Rights_Commission_logo.png"
        string_val: "./above_data_train/Chinga_Chang_logo.png"
        string_val: "./above_data_train/Adara_Group_logo.png"
        string_val: "./above_data_train/2015SAFFSuzukiCuplogo.png"
        string_val: "./above_data_train/Logo_of_the_Sydney_Mechanics\'_School_of_Arts.png"
        string_val: "./above_data_train/WVLT_logo.png"
        string_val: "./above_data_train/Centennialcorplogo.png"
        string_val: "./above_data_train/Xenosaga_Pied_Piper_logo.png"
        string_val: "./above_data_train/Boxing_Australia_logo.png"
        string_val: "./above_data_train/Logo_of_Wilsonville_OR.png"
        string_val: "./above_data_train/JUNGLE_JAM.png"
        string_val: "./above_data_train/WesternWashingtonUniversitySeal.png"
        string_val: "./above_data_train/Cinema_cool_logo.png"
        string_val: "./above_data_train/Rod_Santiago_The_Sisters.png"
        string_val: "./above_data_train/A_Foreign_Affair_logo.png"
        string_val: "./above_data_train/Africa_Inland_Mission_logo.png"
        string_val: "./above_data_train/GoodSundayXman.png"
        string_val: "./above_data_train/FIH_WL_Full_Colour_Lockup.png-1344610732.png"
        string_val: "./above_data_train/SeaWorld_San_Antonio_logo.png"
        string_val: "./above_data_train/Farmandia.png"
        string_val: "./above_data_train/CFAX_AM.png"
        string_val: "./above_data_train/HEICO_logo.png"
        string_val: "./above_data_train/SCTCE.png"
        string_val: "./above_data_train/KZWB.png"
        string_val: "./above_data_train/Feckenham_F.C._logo.png"
        string_val: "./above_data_train/Flutter.io_Logo.png"
        string_val: "./above_data_train/KFRCMutualDonLeeLogo.png"
        string_val: "./above_data_train/Zalul_logo_english.png"
        string_val: "./above_data_train/Portmore_United.png"
        string_val: "./above_data_train/WRSR-FM.png"
        string_val: "./above_data_train/Logo_for_the_Belfast_Bikes_hire_scheme.png"
        string_val: "./above_data_train/Neara.png"
        string_val: "./above_data_train/Alcorn_State_University_logo.png"
        string_val: "./above_data_train/All_Around_The_World_logo.png"
        string_val: "./above_data_train/NZ_Performance_Car_TV_logo.png"
        string_val: "./above_data_train/The_Shmoo_Group.png"
        string_val: "./above_data_train/Americana1.png"
        string_val: "./above_data_train/Pullman_High_School_Mascot.png"
        string_val: "./above_data_train/WCYN_(AM)_logo.png"
        string_val: "./above_data_train/Patna_Municipal_Corporation_logo.png"
        string_val: "./above_data_train/Apartment_Therapy_logo.png"
        string_val: "./above_data_train/CHOGM_2015_logo.png"
        string_val: "./above_data_train/KDUC_&_KDUQ_94.3_&_102.5_The_Duck_logo.png"
        string_val: "./above_data_train/DRT_Pulse_logo.png"
        string_val: "./above_data_train/National_Bikers_Roundup_logo.png"
        string_val: "./above_data_train/Quo_Vadis_Restaurant_New_York_-_logo.png"
        string_val: "./above_data_train/FIBA_Asia_Championship_for_Women_2007_logo.png"
        string_val: "./above_data_train/Town_of_Mono.png"
        string_val: "./above_data_train/Red_Rivella_logo_as_of_2016.png"
        string_val: "./above_data_train/The_Company_of_Biologists_seal.png"
