node {
  name: "global_step/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "global_step"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global_step/Assign"
  op: "Assign"
  input: "global_step"
  input: "global_step/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global_step/read"
  op: "Identity"
  input: "global_step"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "IsVariableInitialized"
  op: "IsVariableInitialized"
  input: "global_step"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
}
node {
  name: "cond/Switch"
  op: "Switch"
  input: "IsVariableInitialized"
  input: "IsVariableInitialized"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "cond/switch_t"
  op: "Identity"
  input: "cond/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "cond/switch_f"
  op: "Identity"
  input: "cond/Switch"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "cond/pred_id"
  op: "Identity"
  input: "IsVariableInitialized"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "cond/read/Switch"
  op: "RefSwitch"
  input: "global_step"
  input: "cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "cond/read"
  op: "Identity"
  input: "cond/read/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "cond/Switch_1"
  op: "Switch"
  input: "global_step/Initializer/zeros"
  input: "cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "cond/Merge"
  op: "Merge"
  input: "cond/Switch_1"
  input: "cond/read"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "add/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "add"
  op: "Add"
  input: "cond/Merge"
  input: "add/y"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "Const"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1878
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
            size: 1878
          }
        }
        string_val: "./above_data_raw/BC_Beroe_17_logo.png"
        string_val: "./above_data_raw/Society_for_Information_Management_logo.png"
        string_val: "./above_data_raw/UACCH-AR-logo.png"
        string_val: "./above_data_raw/Logo_Wallabies.png"
        string_val: "./above_data_raw/Erie_Lackawanna_Herald.png"
        string_val: "./above_data_raw/Logo_The_Asia_Foundation.png"
        string_val: "./above_data_raw/KinchBus.png"
        string_val: "./above_data_raw/Android_KitKat_logo.png"
        string_val: "./above_data_raw/Midnite_movies_logo.png"
        string_val: "./above_data_raw/Bridgwater_Town_FC_logo.png"
        string_val: "./above_data_raw/2010_World_Series_official_program.png"
        string_val: "./above_data_raw/Wroxham_F.C.png"
        string_val: "./above_data_raw/CKRN-TV.png"
        string_val: "./above_data_raw/Coleg_Llysfasi_logo.png"
        string_val: "./above_data_raw/Microtel_logo.png"
        string_val: "./above_data_raw/Balmain_campus_logo1.png"
        string_val: "./above_data_raw/Logo_of_the_Geological_Society_of_Glasgow.png"
        string_val: "./above_data_raw/Rathkeale_College_logo.png"
        string_val: "./above_data_raw/The_Joshua_Tree_Tour_2017_logo.png"
        string_val: "./above_data_raw/Montana_Historical_Society_Logo.png"
        string_val: "./above_data_raw/Dominion_Atlantic_Railway_herald.png"
        string_val: "./above_data_raw/Air_Tahiti_Logo.png"
        string_val: "./above_data_raw/Saralee-logo.png"
        string_val: "./above_data_raw/Collingwood_boat_club_logo.png"
        string_val: "./above_data_raw/Palisades_prep_2.png"
        string_val: "./above_data_raw/Lend-lease-logo.png"
        string_val: "./above_data_raw/Haryana_Steelers_Logo.png"
        string_val: "./above_data_raw/Las_Vegas_Fabulous_Sin_City_Rollergirls.png"
        string_val: "./above_data_raw/GUtech-Logo.png"
        string_val: "./above_data_raw/Multimedia_University_logo.png"
        string_val: "./above_data_raw/Bobfm939logo.png"
        string_val: "./above_data_raw/Mukfellas.png"
        string_val: "./above_data_raw/Vivo_por_Elena_logo.png"
        string_val: "./above_data_raw/Club_Phusion_logo.png"
        string_val: "./above_data_raw/Sovcomflot_logo.png"
        string_val: "./above_data_raw/Ibn_Sina_Medical_College_Logo.png"
        string_val: "./above_data_raw/MontrealWanderers.png"
        string_val: "./above_data_raw/Dublin_Wheelers_Cycling_Club_(crest).png"
        string_val: "./above_data_raw/Three_O\'Clock_Lobby_(logo).png"
        string_val: "./above_data_raw/Frankfurt_Major_2015_logo.png"
        string_val: "./above_data_raw/Pay_Less_Super_Markets_logo.png"
        string_val: "./above_data_raw/Aaa_espn1.png"
        string_val: "./above_data_raw/Korfball_Poland.png"
        string_val: "./above_data_raw/Radiowave96.png"
        string_val: "./above_data_raw/Australian_Criminal_Intelligence_Commission_logo.png"
        string_val: "./above_data_raw/Oven_and_Shaker_logo.png"
        string_val: "./above_data_raw/Maynards-Wine-Gums-Small.png"
        string_val: "./above_data_raw/Optinmonster_logo.png"
        string_val: "./above_data_raw/Logo_abrasevic.png"
        string_val: "./above_data_raw/TK_Br\303\270vig_logo.png"
        string_val: "./above_data_raw/Preply,_logo.png"
        string_val: "./above_data_raw/Hama_University_Logo.png"
        string_val: "./above_data_raw/Canal12_posadas.png"
        string_val: "./above_data_raw/K13XD_Prime_News_2003.png"
        string_val: "./above_data_raw/WSMN_logo.png"
        string_val: "./above_data_raw/Opin_logo_en.png"
        string_val: "./above_data_raw/Solvesborgspartiet.png"
        string_val: "./above_data_raw/National_Physique_Committee_logo.png"
        string_val: "./above_data_raw/HSG_Nordhorn.png"
        string_val: "./above_data_raw/Logo_of_Saudia.png"
        string_val: "./above_data_raw/Jhawklogo.png"
        string_val: "./above_data_raw/KPPT-AM_790_The_Deuce_logo.png"
        string_val: "./above_data_raw/Barys_Astana_Logo.png"
        string_val: "./above_data_raw/Sobranie_Cocktail_cigarettes.png"
        string_val: "./above_data_raw/KALE_logo.png"
        string_val: "./above_data_raw/WHFS_1010_logo.png"
        string_val: "./above_data_raw/OGS_Logo.png"
        string_val: "./above_data_raw/Shepherd_University_seal.png"
        string_val: "./above_data_raw/Chilhowie_Seal.png"
        string_val: "./above_data_raw/Reinickendorfer_Fuchse.png"
        string_val: "./above_data_raw/Discogs_logo.png"
        string_val: "./above_data_raw/QTV-TV.png"
        string_val: "./above_data_raw/CSHLlogo.png"
        string_val: "./above_data_raw/Dominion-nfld.png"
        string_val: "./above_data_raw/Ottawa_sens_logo_old.png"
        string_val: "./above_data_raw/Germany_logo.png"
        string_val: "./above_data_raw/Woodside-Valley-Estate-Logo-2014.png"
        string_val: "./above_data_raw/Men_in_Black.png"
        string_val: "./above_data_raw/Paramour_Logo_(Cirque_du_Soleil).png"
        string_val: "./above_data_raw/CILS-FM.png"
        string_val: "./above_data_raw/Ferns_N_Petals_Logo.png"
        string_val: "./above_data_raw/Empires_logo.png"
        string_val: "./above_data_raw/Polski_Cukier_Toru\305\204_logo.png"
        string_val: "./above_data_raw/1649-Ang-Tamang-Daan.png"
        string_val: "./above_data_raw/CARQUEST.png"
        string_val: "./above_data_raw/Ccc-social-logo.png"
        string_val: "./above_data_raw/Singer_Corporation_logo.png"
        string_val: "./above_data_raw/Kitchee_SC_crest.png"
        string_val: "./above_data_raw/West_Coast_Bank.png"
        string_val: "./above_data_raw/Rugby_league_euro_fed.png"
        string_val: "./above_data_raw/Illu_logo_OLVC.png"
        string_val: "./above_data_raw/CAMCHSC.png"
        string_val: "./above_data_raw/Bosascollogo.png"
        string_val: "./above_data_raw/Centro_Ique\303\261o_-_peruvian_football_club.png"
        string_val: "./above_data_raw/Franklin_County,_Missouri_seal.png"
        string_val: "./above_data_raw/Sweden_rugby.png"
        string_val: "./above_data_raw/City_of_dallas_logo.png"
        string_val: "./above_data_raw/Flurry_logo.png"
        string_val: "./above_data_raw/BBA4_logo.png"
        string_val: "./above_data_raw/CNP_logo,_respresent_the_Certified_Network_Professional_program_by_the_NPA.png"
        string_val: "./above_data_raw/Michigan_Bell.png"
        string_val: "./above_data_raw/Evangelical_Lutheran_Church_of_Papua_New_Guinea_Logo.png"
        string_val: "./above_data_raw/LakemoreOhioSeal.png"
        string_val: "./above_data_raw/Aapas_ki_baat.png"
        string_val: "./above_data_raw/Minto_crest.png"
        string_val: "./above_data_raw/Auto-Alliance-Logo.png"
        string_val: "./above_data_raw/WHJJ_new_logo.png"
        string_val: "./above_data_raw/Radio_Antilles_logo.png"
        string_val: "./above_data_raw/Cullompton_Rangers_F.C._logo.png"
        string_val: "./above_data_raw/Corrymeela_logo.png"
        string_val: "./above_data_raw/Globenewlogo.png"
        string_val: "./above_data_raw/Adelaide_500_logo.png"
        string_val: "./above_data_raw/WENY36.png"
        string_val: "./above_data_raw/KVNA-AM.png"
        string_val: "./above_data_raw/Elephant_House_logo.png"
        string_val: "./above_data_raw/London-Marathon-2011-logo.png"
        string_val: "./above_data_raw/KollegStBlasien.png"
        string_val: "./above_data_raw/WDXC-FM_2016.png"
        string_val: "./above_data_raw/Carnet1.png"
        string_val: "./above_data_raw/Avenida_brasil_logo.png"
        string_val: "./above_data_raw/Center_Harbor_Town_Seal.png"
        string_val: "./above_data_raw/Donegal_Democrat_Logo.png"
        string_val: "./above_data_raw/GunstockMountainResort_GilfordNH_LOGO.png"
        string_val: "./above_data_raw/British_National_Party.png"
        string_val: "./above_data_raw/Protestant_Church_in_Sabah_logo.png"
        string_val: "./above_data_raw/Radio_96.1_Logo.png"
        string_val: "./above_data_raw/Department_of_Agriculture_(Australia,_2013\342\200\22315)_logo.png"
        string_val: "./above_data_raw/Australian_Labor_Party_(Victorian_Branch)_logo.png"
        string_val: "./above_data_raw/CEFCU_Logo_2PMS_Tag.png"
        string_val: "./above_data_raw/BerlinNHseal.png"
        string_val: "./above_data_raw/Mount_St_Michael\'s_College_logo.png"
        string_val: "./above_data_raw/Lorenzo_Ruiz_de_Manila_School_logo.png"
        string_val: "./above_data_raw/Shahzanmudasclogo.png"
        string_val: "./above_data_raw/NEWSWATCH_LOGO.png"
        string_val: "./above_data_raw/E-square.png"
        string_val: "./above_data_raw/NWLL_logo.png"
        string_val: "./above_data_raw/Federa\303\247\303\243o_Angolana_de_Basquetebol_(logo).png"
        string_val: "./above_data_raw/Chicago_Area_Rugby_Football_Union_(logo).png"
        string_val: "./above_data_raw/Bayugan-city-ph-seal.png"
        string_val: "./above_data_raw/JoeComColBang.png"
        string_val: "./above_data_raw/Arles2010logo.png"
        string_val: "./above_data_raw/Stickin\'_Around_logo.png"
        string_val: "./above_data_raw/Pacific_Aviation_Museum_Pearl_Harbor_Logo.png"
        string_val: "./above_data_raw/6abc_IKEA_Thanksgiving_Day_Parade.png"
        string_val: "./above_data_raw/Logo_of_Consumer_Electronics_Show.png"
        string_val: "./above_data_raw/Mount_Allison_University_Seal.png"
        string_val: "./above_data_raw/Fabmart_NewLogo.png"
        string_val: "./above_data_raw/Indigenous_Environmental_Network_logo.png"
        string_val: "./above_data_raw/Girabola_Zap_2_Logo.png"
        string_val: "./above_data_raw/Warrior_Dog_Foundation_logo.png"
        string_val: "./above_data_raw/Mrs._Butterworth\'s_Logo.png"
        string_val: "./above_data_raw/Paradisehotel2.png"
        string_val: "./above_data_raw/Doxalitalia.png"
        string_val: "./above_data_raw/Bigla_Cycling_Team_logo.png"
        string_val: "./above_data_raw/KZZI_logo.png"
        string_val: "./above_data_raw/IHSAOriginalMarchLogo.png"
        string_val: "./above_data_raw/Middle_Rio_Grande_Conservancy_District_logo.png"
        string_val: "./above_data_raw/SSV_Aalen_logo.png"
        string_val: "./above_data_raw/Portland_International_Jetport_Logo.png"
        string_val: "./above_data_raw/KBAK29.png"
        string_val: "./above_data_raw/St.._Albert_Steel_Logo.png"
        string_val: "./above_data_raw/21._kooli_logo.png"
        string_val: "./above_data_raw/Taxpayers\'_Alliance_logo.png"
        string_val: "./above_data_raw/Xm_cafe.png"
        string_val: "./above_data_raw/Wacamplogo.png"
        string_val: "./above_data_raw/Horsens_IC_logo.png"
        string_val: "./above_data_raw/Lillehammer_Olympiapark_logo.png"
        string_val: "./above_data_raw/Weebeastie.png"
        string_val: "./above_data_raw/SANSA_logo.png"
        string_val: "./above_data_raw/Kyunghyang_Shinmun_logo.png"
        string_val: "./above_data_raw/Grumman_1976_logo.png"
        string_val: "./above_data_raw/Kdbc_2012.png"
        string_val: "./above_data_raw/Tripura_University_logo.png"
        string_val: "./above_data_raw/WAUD-AM_logo2.png"
        string_val: "./above_data_raw/Njccrest.png"
        string_val: "./above_data_raw/Speedweeks_logo.png"
        string_val: "./above_data_raw/Jefferson_County_tx_seal.png"
        string_val: "./above_data_raw/McCormickTractorsLogo.png"
        string_val: "./above_data_raw/WebSideStory.png"
        string_val: "./above_data_raw/SelhurstHighOriginalG.png"
        string_val: "./above_data_raw/Kingdom_of_Libya_Airlines_logo.png"
        string_val: "./above_data_raw/Unish-Kuri.png"
        string_val: "./above_data_raw/Tamil_Vision_International_Logo.png"
        string_val: "./above_data_raw/Homestead_Book_Company_Logo.png"
        string_val: "./above_data_raw/Escrava01jpg.png"
        string_val: "./above_data_raw/Subhiksha_logo.png"
        string_val: "./above_data_raw/S\303\251paq_logo.png"
        string_val: "./above_data_raw/Logo_2016_women_bandy_wc.png"
        string_val: "./above_data_raw/Matrixbt_logo.png"
        string_val: "./above_data_raw/Sampledutchg.png"
        string_val: "./above_data_raw/Des_Moines_Capitols_Color_Logo.png"
        string_val: "./above_data_raw/Report_sml.png"
        string_val: "./above_data_raw/University_of_Jos_logo.png"
        string_val: "./above_data_raw/Davenport_Panthers_logo.png"
        string_val: "./above_data_raw/KCC-logo.png"
        string_val: "./above_data_raw/ShauryaSuhani.png"
        string_val: "./above_data_raw/MovieTickets.com_Official_Logo,_2015.png"
        string_val: "./above_data_raw/NMHS-logo.png"
        string_val: "./above_data_raw/FromTheBalconyLogo.png"
        string_val: "./above_data_raw/Enerflex_logo.png"
        string_val: "./above_data_raw/Popjapantv-logo.png"
        string_val: "./above_data_raw/KUILFox64.png"
        string_val: "./above_data_raw/Babbar_Khalsa_International_logo_variation.png"
        string_val: "./above_data_raw/Logo_env_1.png"
        string_val: "./above_data_raw/Calgary_Pride.png"
        string_val: "./above_data_raw/Mulholland_Logo.png"
        string_val: "./above_data_raw/Sunshine_Coast_Falcons_logo.png"
        string_val: "./above_data_raw/FV_Bad_Vilbel.png"
        string_val: "./above_data_raw/DIYorg-logo.png"
        string_val: "./above_data_raw/Plattling_Black_Hawks.png"
        string_val: "./above_data_raw/MinistryEducationCultureScience.png"
        string_val: "./above_data_raw/Cardiff_Design_Festival_07.png"
        string_val: "./above_data_raw/ESClogo.png"
        string_val: "./above_data_raw/Leichhardt_Council_Logo.png"
        string_val: "./above_data_raw/C-Restaurant-logo-2014.png"
        string_val: "./above_data_raw/NewMexicoStars.png"
        string_val: "./above_data_raw/Planetdinosaurtitle.png"
        string_val: "./above_data_raw/Fisk_University_logo.png"
        string_val: "./above_data_raw/Dutch_Windmills_logo.png"
        string_val: "./above_data_raw/Phrack.png"
        string_val: "./above_data_raw/Techguy2.png"
        string_val: "./above_data_raw/Edmark_logo.png"
        string_val: "./above_data_raw/Danube_University_Krems_Logo.png"
        string_val: "./above_data_raw/Glostrup_IC.png"
        string_val: "./above_data_raw/Logo_Tonga_Rugby.png"
        string_val: "./above_data_raw/KLAMlogo2.png"
        string_val: "./above_data_raw/Ascend_Federal_Credit_Union_Logo.png"
        string_val: "./above_data_raw/Russian_Standard_Bank_Logo.png"
        string_val: "./above_data_raw/BainbridgeCSeal.png"
        string_val: "./above_data_raw/RailersPBL.png"
        string_val: "./above_data_raw/Latvia_national_rugby_league_team_logo.png"
        string_val: "./above_data_raw/Utah_Airways_Logo.png"
        string_val: "./above_data_raw/LogoMetroLigero.png"
        string_val: "./above_data_raw/WSFL_2008_Logo.png"
        string_val: "./above_data_raw/Robins_Donuts.png"
        string_val: "./above_data_raw/Tandberg_Storage_logo.png"
        string_val: "./above_data_raw/BillyAndMandy.png"
        string_val: "./above_data_raw/HobartWilliamSmithathletics.png"
        string_val: "./above_data_raw/Thunder.png"
        string_val: "./above_data_raw/Kaguya_mark.png"
        string_val: "./above_data_raw/Keysborough_College_Logo.png"
        string_val: "./above_data_raw/Al_Jazeera_Mubasher.png"
        string_val: "./above_data_raw/Casper_College_logo.png"
        string_val: "./above_data_raw/2007_JAPAN_SERIES.png"
        string_val: "./above_data_raw/Cathay_Bank_logo.png"
        string_val: "./above_data_raw/T\303\251l\303\251-Annonces.png"
        string_val: "./above_data_raw/CKCE-FM.png"
        string_val: "./above_data_raw/Gurren-english.png"
        string_val: "./above_data_raw/Department_of_Space_logo.png"
        string_val: "./above_data_raw/Alerton.png"
        string_val: "./above_data_raw/InvictaInternationalLogo.png"
        string_val: "./above_data_raw/2002NBAFinals.png"
        string_val: "./above_data_raw/Smith_Corona_Logo.png"
        string_val: "./above_data_raw/Forest_Industries_Telecommunications_logo.png"
        string_val: "./above_data_raw/The_National_Film_and_Television_School_Logo.png"
        string_val: "./above_data_raw/Big_Brother_Sverige.png"
        string_val: "./above_data_raw/Code_Club_logo.png"
        string_val: "./above_data_raw/Angkasa_Pura_logo_2011.png"
        string_val: "./above_data_raw/Dom-Hotel_logo.png"
        string_val: "./above_data_raw/Saltlakepotash.png"
        string_val: "./above_data_raw/NHSF_(UK)_logo.png"
        string_val: "./above_data_raw/Logo_of_Jabong.png"
        string_val: "./above_data_raw/Anjunabeats_logo.png"
        string_val: "./above_data_raw/Mablogob.png"
        string_val: "./above_data_raw/BBC_News_titles.png"
        string_val: "./above_data_raw/RT\303\211_Network_Ltd.png"
        string_val: "./above_data_raw/Peruvian_millionaire_logo.png"
        string_val: "./above_data_raw/KFLY-FM.png"
        string_val: "./above_data_raw/Government_College_of_Engineering,_Chandrapur_logo.png"
        string_val: "./above_data_raw/Remix_OS_logo.png"
        string_val: "./above_data_raw/FMOD_logo.png"
        string_val: "./above_data_raw/Western_Cape_Provincial_Parliament_emblem.png"
        string_val: "./above_data_raw/INET_Logo.png"
        string_val: "./above_data_raw/Z_Rock_logo.png"
        string_val: "./above_data_raw/PlusTV.png"
        string_val: "./above_data_raw/HulaBowl2018.png"
        string_val: "./above_data_raw/LisbonCTseal.png"
        string_val: "./above_data_raw/Conanshow.png"
        string_val: "./above_data_raw/Greater_Sudbury_Police_Service_Logo.png"
        string_val: "./above_data_raw/Telecom_Infra_Project.png"
        string_val: "./above_data_raw/Lto-logo.png"
        string_val: "./above_data_raw/Pcnc.png"
        string_val: "./above_data_raw/Logo_of_Aboriginal_Affairs_NSW_2009.png"
        string_val: "./above_data_raw/Icon_Avengers.png"
        string_val: "./above_data_raw/FIBA_Oceania_logo.png"
        string_val: "./above_data_raw/Eesti_Energia_logo.png"
        string_val: "./above_data_raw/CB_Conquero_logo.png"
        string_val: "./above_data_raw/2003_MLS_All-Star_Game_logo.png"
        string_val: "./above_data_raw/Charles_M._Schulz_-_Sonoma_County_Airport_(logo).png"
        string_val: "./above_data_raw/City_of_Broadmeadows_Logo.png"
        string_val: "./above_data_raw/WKIK-FM.png"
        string_val: "./above_data_raw/Walt_Disney_Animation_Studios_logo.png"
        string_val: "./above_data_raw/Addax_Team_(logo).png"
        string_val: "./above_data_raw/Busan_KT_Sonicboom.png"
        string_val: "./above_data_raw/Broward_College_Logo.png"
        string_val: "./above_data_raw/DowningtownSTEM.png"
        string_val: "./above_data_raw/InternationalInstituteOfBusinessAnalysis.png"
        string_val: "./above_data_raw/Lincoln_Capitols.png"
        string_val: "./above_data_raw/Savannah_Sand_Gnats.png"
        string_val: "./above_data_raw/Western_Alamance_School_Logo.png"
        string_val: "./above_data_raw/Wild_1075_Portland.png"
        string_val: "./above_data_raw/CHR_logo.png"
        string_val: "./above_data_raw/Arabian_Gulf_University_logo.png"
        string_val: "./above_data_raw/Westernbank.png"
        string_val: "./above_data_raw/PBA2012-13_commscup.png"
        string_val: "./above_data_raw/London_Colney_F.C._logo.png"
        string_val: "./above_data_raw/Ekhanei.com_logo.png"
        string_val: "./above_data_raw/Holy_Spirit_School_of_Tagbilaran_logo.png"
        string_val: "./above_data_raw/University_of_Hafr_Albatin_seal.png"
        string_val: "./above_data_raw/UofT_Logo.png"
        string_val: "./above_data_raw/National_Rail_Chaplaincy_Service_(logo).png"
        string_val: "./above_data_raw/Recreativo_de_Huelva.png"
        string_val: "./above_data_raw/Adelaide_36ers_logo.png"
        string_val: "./above_data_raw/Seine_River_First_Nations_Logo.png"
        string_val: "./above_data_raw/Suffolk_County,_NY_Police_Aviation_-_Wiki.png"
        string_val: "./above_data_raw/American_Academy_of_Larnaca_(shield).png"
        string_val: "./above_data_raw/UniversityAlicanteSeal.png"
        string_val: "./above_data_raw/Ithaca_Tompkins_Regional_Airport_(logo).png"
        string_val: "./above_data_raw/HighParkDemons.png"
        string_val: "./above_data_raw/Glasgow_Roller_Derby_3_Color_Logo.png"
        string_val: "./above_data_raw/Taco_Bell_2016.png"
        string_val: "./above_data_raw/Arameisk-Syrianska_logo.png"
        string_val: "./above_data_raw/Air_Burundi_logo.png"
        string_val: "./above_data_raw/KDVR31.png"
        string_val: "./above_data_raw/London-Symphony-Orchestra-classic-rock.png"
        string_val: "./above_data_raw/Southern_Utah_Thunderbirds_logo.png"
        string_val: "./above_data_raw/Duke-Shield-Nicholas.png"
        string_val: "./above_data_raw/ITV3_HD.png"
        string_val: "./above_data_raw/Anyang_University_UI.png"
        string_val: "./above_data_raw/DanceX_(logo).png"
        string_val: "./above_data_raw/James_Ready_logo.png"
        string_val: "./above_data_raw/Terrebonne_Cobras.png"
        string_val: "./above_data_raw/WREK_Logo.png"
        string_val: "./above_data_raw/Twisted_Timbers_Logo.png"
        string_val: "./above_data_raw/2012NECBasketballTournament.png"
        string_val: "./above_data_raw/California_State_University,_Fullerton_logo.png"
        string_val: "./above_data_raw/Unicorns_of_Love.png"
        string_val: "./above_data_raw/Prior_logo.png"
        string_val: "./above_data_raw/Cyprus_Space_Exploration_Organisation_-_Logo_-_Sep_2016.png"
        string_val: "./above_data_raw/Badgerline.png"
        string_val: "./above_data_raw/Susar_logo.png"
        string_val: "./above_data_raw/Russian_Venture_Company_logo.png"
        string_val: "./above_data_raw/Philracom_logo.png"
        string_val: "./above_data_raw/KZAS-LP_logo.png"
        string_val: "./above_data_raw/L5_Society_(logo).png"
        string_val: "./above_data_raw/2014_Euroleague_Final_Four_logo.png"
        string_val: "./above_data_raw/Acacia_logo.png"
        string_val: "./above_data_raw/CHS-SCHlogo.png"
        string_val: "./above_data_raw/EA_Tiburon_Logo.png"
        string_val: "./above_data_raw/Wjar_dt2_2009.png"
        string_val: "./above_data_raw/Swan_hunter.png"
        string_val: "./above_data_raw/Ballerin_crest.png"
        string_val: "./above_data_raw/Snowbird_Airlines_logo.png"
        string_val: "./above_data_raw/Santa_Gema_FC.png"
        string_val: "./above_data_raw/Naval_Air_Station_Wildwood_Aviation_Museum_Logo.png"
        string_val: "./above_data_raw/FocolareMovement.png"
        string_val: "./above_data_raw/Project_Crimson_logo.png"
        string_val: "./above_data_raw/Clemson_Area_Transit_Cat_Bus_Logo.png"
        string_val: "./above_data_raw/Fpm_index_logo2.png"
        string_val: "./above_data_raw/Tostitos_Logo.png"
        string_val: "./above_data_raw/Knue_stork.png"
        string_val: "./above_data_raw/Candu_logo.png"
        string_val: "./above_data_raw/Glamorganarms.png"
        string_val: "./above_data_raw/Trygdeetaten.png"
        string_val: "./above_data_raw/Logo_for_the_DO-IT_Center,_University_of_Washington.png"
        string_val: "./above_data_raw/GEOS_logo.png"
        string_val: "./above_data_raw/Dallas_Cowboys_navy_uniform.png"
        string_val: "./above_data_raw/WLOR-AM_Sunny_radio_logo.png"
        string_val: "./above_data_raw/Indian_Ocean_Tuna_Commission.png"
        string_val: "./above_data_raw/PDPLogo.png"
        string_val: "./above_data_raw/CARDINAL-OHARA1.png"
        string_val: "./above_data_raw/Okanagan_Mission_Secondary_School_logo.png"
        string_val: "./above_data_raw/Granada_Television.png"
        string_val: "./above_data_raw/CanGames_emblem.png"
        string_val: "./above_data_raw/Bink_logo.png"
        string_val: "./above_data_raw/Logo_of_Perth_Arena.png"
        string_val: "./above_data_raw/Primeira_Liga_(Brazil).png"
        string_val: "./above_data_raw/Bolder_Media_Wow!_Wow!_Wubbzy!_Wubbzy\'s_Big_Movie_Logo.png"
        string_val: "./above_data_raw/Sirius_XM_POTUS.png"
        string_val: "./above_data_raw/2005_Grand_National_logo.png"
        string_val: "./above_data_raw/WIQH-FM_logo.png"
        string_val: "./above_data_raw/F.C._Fidene_logo.png"
        string_val: "./above_data_raw/VIFF_2014_logo_medium.png"
        string_val: "./above_data_raw/Alabama_Dealer_Motorcycle.png"
        string_val: "./above_data_raw/MVV_Maastricht.png"
        string_val: "./above_data_raw/Sontinh_Original_Ruou-Logo-2015.png"
        string_val: "./above_data_raw/Channel_V_Philippines_1999.png"
        string_val: "./above_data_raw/PSL_Beach_Volleyball_2016.png"
        string_val: "./above_data_raw/Jernhusen_logo.png"
        string_val: "./above_data_raw/MiddleburyLogo.png"
        string_val: "./above_data_raw/CCF_logo.png"
        string_val: "./above_data_raw/CityFlyerExpress.png"
        string_val: "./above_data_raw/Babcock_Logo.png"
        string_val: "./above_data_raw/2012_Sukma_Games_Mascot.png"
        string_val: "./above_data_raw/VGTU_seal.png"
        string_val: "./above_data_raw/Glo_jeans_(logo).png"
        string_val: "./above_data_raw/Association_of_Vermont_Credit_Unions.png"
        string_val: "./above_data_raw/Kryogenifex_logo.png"
        string_val: "./above_data_raw/150px-BroughSuperiorlogo.png"
        string_val: "./above_data_raw/SarasaviyaAward.png"
        string_val: "./above_data_raw/National_Research_University_Higher_School_of_Economics_logo.png"
        string_val: "./above_data_raw/SM-logo_kilpi_rgb.png"
        string_val: "./above_data_raw/College_of_Eastern_Idaho_logo.png"
        string_val: "./above_data_raw/Cox4.png"
        string_val: "./above_data_raw/British_Muslim_TV_logo.png"
        string_val: "./above_data_raw/NowBNC_logo.png"
        string_val: "./above_data_raw/West_Coast_Fever.png"
        string_val: "./above_data_raw/UST_Seal.png"
        string_val: "./above_data_raw/Devon_Cornwall_Police_logo.png"
        string_val: "./above_data_raw/SteelCityMenace.png"
        string_val: "./above_data_raw/Penzu_Logo.png"
        string_val: "./above_data_raw/Brooks_AB_Seal.png"
        string_val: "./above_data_raw/Western_Power_Distribution.png"
        string_val: "./above_data_raw/Devils_Peak_Brewing_Company_Logo.png"
        string_val: "./above_data_raw/WCIR-FM_2009.png"
        string_val: "./above_data_raw/Schweppes_logo.png"
        string_val: "./above_data_raw/Textil_mandiyu.png"
        string_val: "./above_data_raw/West_Bromwich_Building_Society.png"
        string_val: "./above_data_raw/Portland_Thunder_helmet_1975.png"
        string_val: "./above_data_raw/BiloxiShuckersCapLogo.png"
        string_val: "./above_data_raw/Surigao_Educaition_Center_Logo.png"
        string_val: "./above_data_raw/Centroamericano2001.png"
        string_val: "./above_data_raw/Pharmafabrik_Logo.png"
        string_val: "./above_data_raw/Banner_home_logo_about.png"
        string_val: "./above_data_raw/CityofSeaTacLOGO.png"
        string_val: "./above_data_raw/ViewVC_logo.png"
        string_val: "./above_data_raw/Logo_Dubai_College.png"
        string_val: "./above_data_raw/Aker_Seafoods_Logo.png"
        string_val: "./above_data_raw/Laverda.png"
        string_val: "./above_data_raw/KAEF_Logo.png"
        string_val: "./above_data_raw/Laragh_United_GFC_Crest.png"
        string_val: "./above_data_raw/1999frozenfour.png"
        string_val: "./above_data_raw/I-League_logo.png"
        string_val: "./above_data_raw/KMHK-FM.png"
        string_val: "./above_data_raw/El-Rey-Del-Mundo.png"
        string_val: "./above_data_raw/BM_Sagunto.png"
        string_val: "./above_data_raw/STV_HD_2014.png"
        string_val: "./above_data_raw/Asociaci\303\263n_de_Scouts_de_Cuba_1940s.png"
        string_val: "./above_data_raw/MiLB_logo.png"
        string_val: "./above_data_raw/Lanica_logo.png"
        string_val: "./above_data_raw/Holy_Trinity_Catholic_High_School(Simcoe)_Logo.png"
        string_val: "./above_data_raw/American_University_of_the_Middle_East_(AUM).png"
        string_val: "./above_data_raw/Forgotten_Realms_logo.png"
        string_val: "./above_data_raw/Cowes_Sports_F.C._logo.png"
        string_val: "./above_data_raw/KTN_News_logo.png"
        string_val: "./above_data_raw/Wbek_logo.png"
        string_val: "./above_data_raw/Giants_N\303\266rdlingen_logo.png"
        string_val: "./above_data_raw/Field_Move_logo.png"
        string_val: "./above_data_raw/The_Movie_Channel_1988.png"
        string_val: "./above_data_raw/Adsense_rebranded_with_a_new_logo.png"
        string_val: "./above_data_raw/Qingdao_University_banner.png"
        string_val: "./above_data_raw/Real_Art_Logo.png"
        string_val: "./above_data_raw/Fisher_Mall_Logo.png"
        string_val: "./above_data_raw/Russneft_Logo.png"
        string_val: "./above_data_raw/VykeBusiness_Logo.png"
        string_val: "./above_data_raw/Plunket.png"
        string_val: "./above_data_raw/Saddleback_Church_logo.png"
        string_val: "./above_data_raw/FreedomPlus-logo-2013-814x180.png"
        string_val: "./above_data_raw/French_Basketball_Cup_logo.png"
        string_val: "./above_data_raw/Hokusei_Gakuen_University_Logo.png"
        string_val: "./above_data_raw/Banshee_(KI)_Logo.png"
        string_val: "./above_data_raw/The_Tide_Newspaper_logo.png"
        string_val: "./above_data_raw/KLIN_logo.png"
        string_val: "./above_data_raw/Code_Blocks_logo.png"
        string_val: "./above_data_raw/GameshowMarathon2007.png"
        string_val: "./above_data_raw/Sheffield_High_School_Emblem.png"
        string_val: "./above_data_raw/Cornwallfrsbadge.png"
        string_val: "./above_data_raw/Germania_Wiesbaden.png"
        string_val: "./above_data_raw/Brandeis_University_seal.png"
        string_val: "./above_data_raw/Lottery_logo.png"
        string_val: "./above_data_raw/Swazi_logo.png"
        string_val: "./above_data_raw/SSAkragas.png"
        string_val: "./above_data_raw/School_of_the_EpiphanyLogo.png"
        string_val: "./above_data_raw/Malibu_Comics_logo.png"
        string_val: "./above_data_raw/Nazrul_Institute_Logo.png"
        string_val: "./above_data_raw/HoumaConquerors.png"
        string_val: "./above_data_raw/Reflex_Paramoteur_logo.png"
        string_val: "./above_data_raw/Yaziza.png"
        string_val: "./above_data_raw/ETI_LOGO_4COL.png"
        string_val: "./above_data_raw/SciELOlogo.png"
        string_val: "./above_data_raw/2008PreaknessLogo.png"
        string_val: "./above_data_raw/Danelectro_logo.png"
        string_val: "./above_data_raw/General-Magic-Logo.png"
        string_val: "./above_data_raw/The_movie_channel_uk_logo_1990.png"
        string_val: "./above_data_raw/Commercial_international_bank_CIB_logo_latest.png"
        string_val: "./above_data_raw/WelshFactor_logo.png"
        string_val: "./above_data_raw/Sreegopal_Banerjee_College.png"
        string_val: "./above_data_raw/Night_Tracks_logo_blue.png"
        string_val: "./above_data_raw/WXND-LP_logo.png"
        string_val: "./above_data_raw/Covenant_party_CNMI_logo.png"
        string_val: "./above_data_raw/Bad_Reichenhall_RL.png"
        string_val: "./above_data_raw/Womclogo.png"
        string_val: "./above_data_raw/Wpbf_2010.png"
        string_val: "./above_data_raw/Bovislogo.png"
        string_val: "./above_data_raw/WTUV-FM_logo.png"
        string_val: "./above_data_raw/Anna-Schmidt-Schule.png"
        string_val: "./above_data_raw/IACoS.png"
        string_val: "./above_data_raw/G7_2016_Shima_Logo.png"
        string_val: "./above_data_raw/JohnsonCityCardinalsCapLogo.png"
        string_val: "./above_data_raw/Naples_Municipal_Airport_(emblem).png"
        string_val: "./above_data_raw/Logo_of_the_Canadian_Medical_and_Biological_Engineering_Society.png"
        string_val: "./above_data_raw/Manningham_United_Logo.png"
        string_val: "./above_data_raw/Semper_Solaris_Logo.png"
        string_val: "./above_data_raw/IUP_Bear.png"
        string_val: "./above_data_raw/The_Gossip_Table_logo.png"
        string_val: "./above_data_raw/Dirty_Money_The_Story_of_the_Criminal_Assets_Bureau.png"
        string_val: "./above_data_raw/Grameephone_Logo.png"
        string_val: "./above_data_raw/MeTV_WBND.png"
        string_val: "./above_data_raw/Merley_Cobham_Sports_F.C._logo.png"
        string_val: "./above_data_raw/Camelliait.png"
        string_val: "./above_data_raw/KMHL.png"
        string_val: "./above_data_raw/Delta-academies-trust-logo.png"
        string_val: "./above_data_raw/Haifaff_logo_eng.png"
        string_val: "./above_data_raw/Foreign_Languages_Publishing_House_(Soviet_Union).png"
        string_val: "./above_data_raw/Central_F.C.png"
        string_val: "./above_data_raw/Gabrielle-roy_school_logo.png"
        string_val: "./above_data_raw/APSRTC_Logo.png"
        string_val: "./above_data_raw/ShaheenCollegeLogo.png"
        string_val: "./above_data_raw/Poweroffivelogo.png"
        string_val: "./above_data_raw/NationalUniversityofSingapore.png"
        string_val: "./above_data_raw/Shire_of_Tammin_Logo.png"
        string_val: "./above_data_raw/Logo_Dodwell_&_Co.png"
        string_val: "./above_data_raw/British-German_Association_Logo.png"
        string_val: "./above_data_raw/Maricourt_Catholic_High_School_Crest.png"
        string_val: "./above_data_raw/KOOL1071.png"
        string_val: "./above_data_raw/Sun_Country_Airlines_Logo.png"
        string_val: "./above_data_raw/Logo_Women\'s_World_Open_2007.png"
        string_val: "./above_data_raw/Singapore_Cup_logo.png"
        string_val: "./above_data_raw/Momondo_A-S_logo.png"
        string_val: "./above_data_raw/Logo_of_Laver_Cup.png"
        string_val: "./above_data_raw/RBS_International.png"
        string_val: "./above_data_raw/IMPACTLogo.png"
        string_val: "./above_data_raw/Dorsey_Emmet\'s_Gaelic_Football_Club_logo.png"
        string_val: "./above_data_raw/BaldwinHillsLogo3.png"
        string_val: "./above_data_raw/Empas_logo.png"
        string_val: "./above_data_raw/ULSTR350.png"
        string_val: "./above_data_raw/WAWB.png"
        string_val: "./above_data_raw/FWB-logo.png"
        string_val: "./above_data_raw/Fma-nz-logo.png"
        string_val: "./above_data_raw/SD_Lenense.png"
        string_val: "./above_data_raw/International_Broadcasting_Union,_logo_(1939-1945).png"
        string_val: "./above_data_raw/Ulaanbaatar_City_FC_Logo.png"
        string_val: "./above_data_raw/Seal_of_Unionville,_North_Carolina.png"
        string_val: "./above_data_raw/ChannelV_PH_Logo.png"
        string_val: "./above_data_raw/Rocky_Mountain_Athletic_Conference_logo.png"
        string_val: "./above_data_raw/UTour_logo_dark_url.png"
        string_val: "./above_data_raw/Holy_Ghost_Preparatory_School_(crest).png"
        string_val: "./above_data_raw/Pass_Plus_Logo.png"
        string_val: "./above_data_raw/Yarroweyah_Football_Club_logo.png"
        string_val: "./above_data_raw/KPAT-FM.png"
        string_val: "./above_data_raw/Grupo_CIE_logo.png"
        string_val: "./above_data_raw/11th_latin_grammy.png"
        string_val: "./above_data_raw/Former_cmc_official_logo.png"
        string_val: "./above_data_raw/ADST_Logo_2017.png"
        string_val: "./above_data_raw/BuffaloStampede.png"
        string_val: "./above_data_raw/WashingtonWarriors.png"
        string_val: "./above_data_raw/Ao.com_logo.png"
        string_val: "./above_data_raw/Lsc-o_seal.png"
        string_val: "./above_data_raw/Maitland_High_School_logo.png"
        string_val: "./above_data_raw/E-470.png"
        string_val: "./above_data_raw/RadarOnline_Logo.png"
        string_val: "./above_data_raw/KNTH_Old.png"
        string_val: "./above_data_raw/DakotaStU.png"
        string_val: "./above_data_raw/SBS_2_2015_logo.png"
        string_val: "./above_data_raw/Kazimieras_Simonavi\304\215ius_University_logo.png"
        string_val: "./above_data_raw/Reality_of_wrestling_logo.png"
        string_val: "./above_data_raw/DC_Comics_logo_2005\342\200\2232012.png"
        string_val: "./above_data_raw/Ghana_BBall_Association.png"
        string_val: "./above_data_raw/Black_Family_Channel.png"
        string_val: "./above_data_raw/Parsian_Bank_logo.png"
        string_val: "./above_data_raw/ToysForBob.png"
        string_val: "./above_data_raw/Reptoncrest.png"
        string_val: "./above_data_raw/Sakura_(cigarette).png"
        string_val: "./above_data_raw/Alcester_Town_F.C.png"
        string_val: "./above_data_raw/Jekyll_2007_title_card.png"
        string_val: "./above_data_raw/Pasemilogo.png"
        string_val: "./above_data_raw/Edmonton_Indy_Logo.png"
        string_val: "./above_data_raw/Toho_Bank_logo.png"
        string_val: "./above_data_raw/Dentalschoollogo.png"
        string_val: "./above_data_raw/WGMD_small_logo.png"
        string_val: "./above_data_raw/National_Women\'s_Basketball_League.png"
        string_val: "./above_data_raw/Antero_resources_logo_2017.png"
        string_val: "./above_data_raw/SC_1880_Frankfurt.png"
        string_val: "./above_data_raw/Logo_of_Coachella_Valley_Mountains_Conservancy.png"
        string_val: "./above_data_raw/HM_Government.png"
        string_val: "./above_data_raw/Avenues_United.png"
        string_val: "./above_data_raw/Saurashtra_University_Emblem.png"
        string_val: "./above_data_raw/Nacionalguadalajara.png"
        string_val: "./above_data_raw/Strava_Logo.png"
        string_val: "./above_data_raw/KK_Mega_Vizura_Logo_2014.png"
        string_val: "./above_data_raw/Aware_Records.png"
        string_val: "./above_data_raw/St_Ann\'s_Rangers.png"
        string_val: "./above_data_raw/Richmondbcflag.png"
        string_val: "./above_data_raw/National_Union_of_Students_UK_logo.png"
        string_val: "./above_data_raw/St_John\'s_College,_University_of_Sydney_coat_of_arms.png"
        string_val: "./above_data_raw/WMJD-FM_2014.png"
        string_val: "./above_data_raw/Lotto_649_logo.png"
        string_val: "./above_data_raw/GOZOCOATOFARMS.png"
        string_val: "./above_data_raw/Valhalla-Logo.png"
        string_val: "./above_data_raw/Cassella_logo.png"
        string_val: "./above_data_raw/Odfjell_Drilling_logo.png"
        string_val: "./above_data_raw/Siggiewifclogo.png"
        string_val: "./above_data_raw/CSM_Satu_Mare_logo.png"
        string_val: "./above_data_raw/Mediacorp_arts_central_logo.png"
        string_val: "./above_data_raw/HuHot_Mongolian_Grill_logo.png"
        string_val: "./above_data_raw/Hightdtown_Rams.png"
        string_val: "./above_data_raw/WXLT.png"
        string_val: "./above_data_raw/Royce_logo.png"
        string_val: "./above_data_raw/StJoeIndia.png"
        string_val: "./above_data_raw/Monster_Raving_Loony_Party.png"
        string_val: "./above_data_raw/Vesuvius_plc_logo.png"
        string_val: "./above_data_raw/WinchesterCTseal.png"
        string_val: "./above_data_raw/RohnertParkLogoEd2662.png"
        string_val: "./above_data_raw/Isotopia_logo.png"
        string_val: "./above_data_raw/NewFactorLogo.png"
        string_val: "./above_data_raw/Sunwell_deepchill_logo_pumpable_slurry_ice.png"
        string_val: "./above_data_raw/Furitechnics.png"
        string_val: "./above_data_raw/Sichuan_FAW_Toyota_Motor_logo.png"
        string_val: "./above_data_raw/Goldplatecard.png"
        string_val: "./above_data_raw/TechonomyMediaLogo.png"
        string_val: "./above_data_raw/HalifaxRainmen.png"
        string_val: "./above_data_raw/Richmond_Theatre_logo.png"
        string_val: "./above_data_raw/Manitoba_Human_Rights_Commission_logo.png"
        string_val: "./above_data_raw/Chinga_Chang_logo.png"
        string_val: "./above_data_raw/Adara_Group_logo.png"
        string_val: "./above_data_raw/2015SAFFSuzukiCuplogo.png"
        string_val: "./above_data_raw/Logo_of_the_Sydney_Mechanics\'_School_of_Arts.png"
        string_val: "./above_data_raw/WVLT_logo.png"
        string_val: "./above_data_raw/Centennialcorplogo.png"
        string_val: "./above_data_raw/Xenosaga_Pied_Piper_logo.png"
        string_val: "./above_data_raw/Boxing_Australia_logo.png"
        string_val: "./above_data_raw/Logo_of_Wilsonville_OR.png"
        string_val: "./above_data_raw/JUNGLE_JAM.png"
        string_val: "./above_data_raw/WesternWashingtonUniversitySeal.png"
        string_val: "./above_data_raw/Cinema_cool_logo.png"
        string_val: "./above_data_raw/Rod_Santiago_The_Sisters.png"
        string_val: "./above_data_raw/A_Foreign_Affair_logo.png"
        string_val: "./above_data_raw/Africa_Inland_Mission_logo.png"
        string_val: "./above_data_raw/GoodSundayXman.png"
        string_val: "./above_data_raw/FIH_WL_Full_Colour_Lockup.png-1344610732.png"
        string_val: "./above_data_raw/SeaWorld_San_Antonio_logo.png"
        string_val: "./above_data_raw/Farmandia.png"
        string_val: "./above_data_raw/CFAX_AM.png"
        string_val: "./above_data_raw/HEICO_logo.png"
        string_val: "./above_data_raw/SCTCE.png"
        string_val: "./above_data_raw/KZWB.png"
        string_val: "./above_data_raw/Feckenham_F.C._logo.png"
        string_val: "./above_data_raw/Flutter.io_Logo.png"
        string_val: "./above_data_raw/KFRCMutualDonLeeLogo.png"
        string_val: "./above_data_raw/Zalul_logo_english.png"
        string_val: "./above_data_raw/Portmore_United.png"
        string_val: "./above_data_raw/WRSR-FM.png"
        string_val: "./above_data_raw/Logo_for_the_Belfast_Bikes_hire_scheme.png"
        string_val: "./above_data_raw/Neara.png"
        string_val: "./above_data_raw/Alcorn_State_University_logo.png"
        string_val: "./above_data_raw/All_Around_The_World_logo.png"
        string_val: "./above_data_raw/NZ_Performance_Car_TV_logo.png"
        string_val: "./above_data_raw/The_Shmoo_Group.png"
        string_val: "./above_data_raw/Americana1.png"
        string_val: "./above_data_raw/Pullman_High_School_Mascot.png"
        string_val: "./above_data_raw/WCYN_(AM)_logo.png"
        string_val: "./above_data_raw/Patna_Municipal_Corporation_logo.png"
        string_val: "./above_data_raw/Apartment_Therapy_logo.png"
        string_val: "./above_data_raw/CHOGM_2015_logo.png"
        string_val: "./above_data_raw/KDUC_&_KDUQ_94.3_&_102.5_The_Duck_logo.png"
        string_val: "./above_data_raw/DRT_Pulse_logo.png"
        string_val: "./above_data_raw/National_Bikers_Roundup_logo.png"
        string_val: "./above_data_raw/Quo_Vadis_Restaurant_New_York_-_logo.png"
        string_val: "./above_data_raw/FIBA_Asia_Championship_for_Women_2007_logo.png"
        string_val: "./above_data_raw/Town_of_Mono.png"
        string_val: "./above_data_raw/Red_Rivella_logo_as_of_2016.png"
        string_val: "./above_data_raw/The_Company_of_Biologists_seal.png"
        string_val: "./above_data_raw/SouthSuburbanConferencelogo.png"
        string_val: "./above_data_raw/West_Island_College_Montreal_Logo.png"
        string_val: "./above_data_raw/Manitoba_Aviation_Council_logo.png"
        string_val: "./above_data_raw/Burmah_Oil_logo.png"
        string_val: "./above_data_raw/Hotel_Institute_Montreux_(logo).png"
        string_val: "./above_data_raw/Official_Linode_logo.png"
        string_val: "./above_data_raw/UnitedFutureNewZealandLogo.png"
        string_val: "./above_data_raw/Filmation.png"
        string_val: "./above_data_raw/Rede_Globo_logo.png"
        string_val: "./above_data_raw/FSV_J\303\244gersburg.png"
        string_val: "./above_data_raw/Strands_Recommender_Logo.png"
        string_val: "./above_data_raw/Haikou_College_of_Economics_-_logo_01.png"
        string_val: "./above_data_raw/Wave_in_a_Box_logo.png"
        string_val: "./above_data_raw/WTHU-AM.png"
        string_val: "./above_data_raw/HousatonicRR_Logo.png"
        string_val: "./above_data_raw/Kings_College_Charlotte_NC_(logo).png"
        string_val: "./above_data_raw/London_Central_logo.png"
        string_val: "./above_data_raw/STJ-SC.png"
        string_val: "./above_data_raw/2011_ITU_logo.png"
        string_val: "./above_data_raw/Me-TV_KATU_Portland.png"
        string_val: "./above_data_raw/YouSendIt.png"
        string_val: "./above_data_raw/FM1063.png"
